[{"source":{"id":"abc-news","name":"ABC News"},"author":"The Associated Press","title":"Soccer player injured in knife attack calls himself 'lucky'","description":"Spanish soccer player Pablo Marí called himself “lucky” to survive after getting wounded in a knife attack at an Italian shopping center","url":"https://abcnews.go.com/Sports/wireStory/soccer-player-injured-knife-attack-calls-lucky-92274474","urlToImage":"https://s.abcnews.com/images/Sports/WireAP_11de5d5d29c7420fb6819e04b9a17b30_16x9_992.jpg","publishedAt":"2022-10-28T09:44:13Z","content":"MILAN -- Pablo Marí, the Spanish soccer player who was wounded in a knife attack at an Italian shopping center, called himself lucky to survive and was being treated Friday following injuries to his … [+3005 chars]","fullContent":"MILAN -- Being in top physical form helped Spanish soccer player Pablo Marí avoid life-threatening injuries in         a knife attack at an Italian shopping center, the surgeon who operated on his wounded back said Friday.“The surgery was a relatively simple one. Luckily there were only two damaged muscles,” said Osvaldo Chiara, the director of the general surgery and trauma team at the Niguarda hospital in Milan. “(Marí’s) muscular mass is such that the length of the knife that was used couldn’t pass through the rib cage and hit his lung.”Monza, the Serie A club that Marí plays for on loan from Arsenal, said that Marí should spend another “two or three days” recovering at the hospital.The club added that Marí will likely need two months of rest before resuming physical activity, while Monza CEO Adriano Galliani said it would likely be three months before Marí played again.The Spanish defender posted         a photo of himself on Instagram giving a thumbs-up gesture in his hospital bed, and wrote that he and his family \"are all fine despite the circumstances.”Galliani said that the squad was “in shock” and had asked Serie A to postpone its next game, against Bologna on Monday. But the league did not change the fixture.The 29-year-old Marí called himself “lucky” to survive following injuries to his back and mouth.Five people were stabbed Thursday and one was killed after a man grabbed a knife from a supermarket shelf, authorities said.Police arrested a 46-year-old Italian man suspected in the attack at a shopping center in Assago, a suburb of Milan, carabinieri said.“He told me he had ‘suerte’ (luck), because, ‘today I saw someone else die,’ Galliani said after visiting Marí at the hospital late Thursday.“He had his child in a cart and his wife next to him. ... He was probably saved by his height,\" Galliani said of the 1.93-meter (6-foot-4) Marí. \"He was hit in the back and then he saw this delinquent stab someone in the throat.”Massimo Tarantino, a former soccer player for Napoli and Inter Milan, was involved in stopping the assailant.“He was just screaming,” Tarantino told reporters. “I didn’t do anything. I’m not a hero.”Galliani said Marí also had injuries to his mouth, possibly from gritting his teeth during the attack.“He had two stitches applied to his lip and injuries to his back, which fortunately did not affect any organs,” Galliani said, adding that Marí was “lucid.”Marí’s wife was questioned by police as a witness to the attack, Galliani said.Marí, a center back, has played in eight of Monza’s 11 Italian league games this season and scored the second goal in a 2-0 win over Spezia this month. He spent the second half of last season on loan with Udinese, another Italian club.Monza, which is owned by former Italian premier Silvio Berlusconi, is playing its debut season in the top division.“Pablo is a great kid,” Galliani said. “He had the strength to joke around, telling me that Monday he’ll be on the field. I brought him well wishes from president Berlusconi and all of his teammates.”A supermarket employee died en route to the hospital, according to the news agency ANSA, which said three other victims were in serious condition. Another person was treated for shock but not hospitalized, police said.Monza coach Raffaele Palladino also visited with Marí, and Monza issued a statement on Twitter on Friday mourning the victim in the attack.“All of AC Monza shares deeply in the family’s pain for the loss of Luis Fernando Ruggieri, victim of the madness that took place last night in Assago,\" the club said. \"Thoughts also go in these hours to the other people injured and their families.”The motive for the attacks was unknown, but police said the man showed signs of being psychologically unstable. There were no elements to suggest terrorism.The attack occurred near the Assago Forum, an arena that is slated to host figure skating and short-track speedskating for the 2026 Milan-Cortina Olympics.———AP World Cup coverage: https://apnews.com/hub/world-cup and https://twitter.com/AP—Sports"},{"source":{"id":"abc-news","name":"ABC News"},"author":"GRAHAM DUNBAR AP Sports Writer","title":"Ukrainian club urges FIFA to remove Iran from World Cup","description":"Ukraine’s top soccer club has urged FIFA to remove Iran from the World Cup because of the country’s alleged military support to the Russian invasion","url":"https://abcnews.go.com/Sports/wireStory/ukrainian-club-urges-fifa-remove-iran-world-cup-91996868","urlToImage":"https://s.abcnews.com/images/International/WireAP_d0d3e279fb2f4f919a5b4236f4057cd1_16x9_992.jpg","publishedAt":"2022-10-24T12:45:12Z","content":"GENEVA -- Ukraines top soccer club on Monday urged FIFA to remove Iran from the World Cup because of the country's alleged military support to the Russian invasion.\r\nShakhtar Donetsk chief executive … [+2657 chars]","fullContent":"GENEVA -- Ukraine’s top soccer club on Monday urged FIFA to remove Iran from the         World Cup because of the country's alleged military support to the Russian invasion.Shakhtar Donetsk chief executive Sergei Palkin accused Iran of “direct participation in terrorist attacks on Ukrainians,” suggesting his own country’s team should play in Qatar instead as a replacement.“This will be a fair decision that should draw the attention of the whole world to a regime that kills its best people and helps kill Ukrainians,” Palkin said in a statement one day before his team plays at Celtic in the Champions League.The White House said Thursday that the U.S. has evidence         that Iranian troops are “directly engaged on the ground” in Crimea supporting Russian drone attacks on Ukraine’s infrastructure and civilian population. And the head of Ukraine’s intelligence service, Kyrylo Budanov, said in a published interview on Monday that Russian forces had used about 330 Iranian-built “Shahed” drones as of Saturday — and that more had been ordered.Russia and Iran have both denied that the drones used were Iranian-built. Iran plays in the second game of the World Cup, on Nov. 21 against England, and then faces Wales and the United States in Group B. Wales qualified by beating Ukraine in the playoffs in June in a game that was delayed from March by the war.FIFA did not immediately respond to a request for comment. However, if an Asian team was suspended there would be no precedent for FIFA to replace it with a European team at the World Cup. Soccer's world body does not typically suspend member federations because of military decisions by a national government, though Yugoslavia was barred from trying to qualify for the 1994 World Cup after United Nations sanctions were imposed during the war in the Balkans.FIFA has suspended Russian teams following its invasion of Ukraine, which barred Russia from playing in the World Cup qualifying playoffs in March. FIFA cited risks to the security and integrity of its competitions, and Russia’s scheduled opponent Poland had refused to play that game.FIFA is also resisting calls this month from Iranian fan groups to suspend the national team during a national crackdown on street protests in support of women’s rights and because of a long-time policy stopping women from freely attending games in soccer and other sports.FIFA normally only suspends national teams when the country's government is judged to have interfered in the independent running of the national soccer federation.Five Asian confederation teams advanced to the World Cup to join host Qatar, and the United Arab Emirates was the next best in qualifying. The UAE lost a regional playoff in June to Australia ahead of the intercontinental playoffs.———AP World Cup coverage: https://apnews.com/hub/world-cup and https://twitter.com/AP—Sports"},{"source":{"id":"abc-news","name":"ABC News"},"author":"The Associated Press","title":"FIFA urges World Cup teams to focus on soccer over politics","description":"Soccer's top officials have urged the 32 teams preparing for the most political World Cup in the modern to focus on the game in Qatar and avoid handing out lessons in morality","url":"https://abcnews.go.com/Sports/wireStory/fifa-urges-world-cup-teams-focus-soccer-politics-92652746","urlToImage":"https://s.abcnews.com/images/Sports/WireAP_e619480b646f4b0c9868c22df8095cfa_16x9_992.jpg","publishedAt":"2022-11-04T10:29:20Z","content":"ZURICH -- Soccer's top officials have urged the 32 teams preparing for the most political World Cup in the modern era to focus on the game in Qatar and avoid handing out lessons in morality.\r\nA lette… [+2615 chars]","fullContent":"GENEVA -- FIFA's top officials have urged the 32 teams preparing for the most political         World Cup in the modern era to focus on the game in Qatar and avoid handing out lessons in morality.A letter urging teams to “let football take center stage” was sent by FIFA president Gianni Infantino and secretary general Fatma Samoura ahead of intense media focus on coaches and players when World Cup squads are announced next week.“Please, let’s now focus on the football!” Infantino and Samoura wrote, asking the 32 soccer federations to “not allow football to be dragged into every ideological or political battle that exists.”Qatar being picked in 2010 as World Cup host sparked scrutiny on its treatment of         low-paid migrant workers needed to build projects costing tens of billions of dollars and its laws criminalizing same-sex relationships.FIFA's comments in defense of Qatar follows more strident         targeting of critics in recent weeks by public officials, including the Emir, Sheikh Tamim bin Hamad Al Thani, as the Nov. 20 kickoff nears. The Emir two weeks ago denounced “fabrications and double standards” in what he has called an “unprecedented campaign” against a World Cup host nation.Eight European teams have committed to their captains wearing         heart-shaped armbands — in breach of FIFA rules — to support an anti-discrimination campaign launched in the Netherlands, and         Australia players took part in a video airing concerns about Qatar's human rights record. Several coaches and federations, including the United States, have backed calls to create a compensation fund for migrant workers’ families. Denmark's squad is taking a         black team jersey as a sign of “mourning” for those who died in Qatar.The Dutch soccer federation         pushed back at FIFA late Friday, restating its commitment to leave “lasting improvements in the situation of migrant workers in Qatar.”The Netherlands plays Qatar on Nov. 29 in Group A and the team's officials pledged on Friday to press FIFA on creating a long-term resource center in Doha for migrant workers when world soccer's 211 member federations meet hours before attending the World Cup opening game.Iran has also faced calls to be removed before it plays England in the second game of the World Cup on Nov. 21 in a group that also includes the U.S.Iranian         fan groups want the federation suspended for discriminating against women, and Ukraine soccer officials         asked FIFA to remove Iran from the World Cup for human rights violations and supplying the Russian military with weapons.Infantino moved from Switzerland to live in Doha for the past year during preparations for what he has consistently said would be the best World Cup ever. “We know football does not live in a vacuum and we are equally aware that there are many challenges and difficulties of a political nature all around the world,” the FIFA leaders wrote on Thursday in their letter that did not address or identify any specific issue.“At FIFA, we try to respect all opinions and beliefs, without handing out moral lessons to the rest of the world. One of the great strengths of the world is indeed its very diversity, and if inclusion means anything, it means having respect for that diversity.\"Infantino and Samoura added: “No one people or culture or nation is ‘better’ than any other. This principle is the very foundation stone of mutual respect and non-discrimination. And this is also one of the core values of football.\"They repeated long-standing promises made by Qatar, including by its Emir at the United Nations general assembly in New York in September, that all visitors to Qatar will be welcome “regardless of origin, background, religion, gender, sexual orientation or nationality.”In a separate in-house interview published on Friday by FIFA, Samoura acknowledged the perception of Qatar \"as a conservative society, like my own country in Senegal.\"“But let me tell you one thing — Qataris are the most hospitable people you can find on earth,” said the former U.N. official, who is also of Muslim faith. Frustration with the scrutiny on the first Arab host of the World Cup led at least two government ministers this week to suggest race as a motive.“Is such racism acceptable in Europe in the 21st century? Football belongs to everyone,” Foreign Minister Sheikh Mohammed bin Abdulrahman Al Thani said in an interview with French daily Le Monde published on Friday.Labor Minister Ali bin Samikh Al Marri said this week that calls to create a compensation fund for migrant workers were a \"publicity stunt,” and cited a Qatari-backed scheme that had paid tens of millions of dollars.FIFA and Qatari officials have long insisted hosting the World Cup accelerated the modernizing of labor laws which Samoura said on Friday was accepted as a model for regional neighbors to follow.About 1.2 million international visitors are expected in Qatar during the Nov. 20-Dec. 18 tournament.———AP World Cup coverage: https://apnews.com/hub/world-cup and https://twitter.com/AP—Sportsc"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Cristiano Ronaldo: Will forward and Manchester United agree an exit strategy with 'the end in sight'?","description":"After Cristiano Ronaldo was left out of the squad to face Chelsea on Saturday, does the Portugal forward have a future at Manchester United?","url":"https://www.bbc.co.uk/sport/football/63361725","urlToImage":"https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/097E/production/_127303420_cristianoronaldo.png","publishedAt":"2022-10-22T22:59:45Z","content":"Cristiano Ronaldo has mostly been used from the bench this season by Manchester United\r\nCristiano Ronaldo may not have played as Manchester United rescued a dramatic point against Chelsea on Saturday… [+5450 chars]","fullContent":"Cristiano Ronaldo has mostly been used from the bench this season by Manchester UnitedCristiano Ronaldo may not have played as Manchester United rescued a dramatic point against Chelsea on Saturday, but he still ended up being one of the major talking points.The forward's refusal to come on as substitute in Wednesday's 2-0 win against Tottenham, and subsequent decision to leave Old Trafford before the final whistle, has dominated the headlines in a week that United should be celebrating taking a very decent four points from top four rivals.As the players celebrated Casemiro's late equaliser at Stamford Bridge, Ronaldo's whereabouts were unknown after being dropped from the squad as a punishment by United manager Erik ten Hag.The Dutchman insisted afterwards his side still \"needed\" the Portuguese but questions remain whether his fairytale return is destined for an unceremonious end.Former Manchester United captain Gary Neville believes it is now only a matter of when, not if, Ronaldo departs this season.\"Cristiano Ronaldo is going to have to go somewhere else and play every week because he can't accept being on the bench,\" he said on Sky Sports. \"That's fine, but end it this week or create a truce to get to the World Cup and then end it. \"It has to end.\"All the latest Manchester United news, analysis and fan views in one placeYou can now get Man Utd news notifications in the BBC Sport app - find out morePodcast: The Devils' Advocate - listen to the latest episode on BBC SoundsIs there no way back?Ronaldo's actions in the final few minutes against Spurs has caused plenty of debate, but the overriding feeling appears to be that the bridges have now been burned. Manchester United boss Erik ten Hag displayed his authority by dropping Ronaldo for the Chelsea game and excluding him from training with his first team squad.The scenes of celebrations among the Manchester United players after Casemiro's 94th-minute equaliser against Chelsea underlined what Ten Hag is trying to protect as they showed fight, spirit and togetherness.\"I doubt Ronaldo plays for Manchester United again,\" former England goalkeeper Rob Green said on BBC Radio 5 Live. \"It is a messy divorce but Ten Hag has waited for a moment. Ronaldo has burnt his bridges.\"Just a few weeks ago Ronaldo was rightly being lauded for hitting the career landmark of 700 club goals. At 37, time is no longer on his side and some people can understand his displays of frustration as he desperately seeks game time.Former Manchester United defender Rio Ferdinand believes the situation could have been handled better.\"I would not have been happy as a player but emotions sometimes take it out of you as a human,\" he said.\"Maybe communication hasn't been as clear when dealing with Ronaldo - probably the greatest player to ever play, along with Lionel Messi.\"He needs that communication now more than ever. He is my mate and you want to see your friends do well but I wouldn't condone that in the dressing room. If communication is not there, problems arise.\"Ex-Manchester United midfielder Roy Keane added: \"Players have done a lot worse at Manchester United. \"Is there a way back for him? I'm not sure.\"Ten Hag not closing the door just yetCristiano Ronaldo has made eight Premier League appearances this season, with six of those from the benchBut despite what observers may think, Ten Hag has not closed the door on Ronaldo.He was Manchester United's top scorer last season and rescued his side on many occasions with dramatic late goals. Asked if the team missed Ronaldo on Saturday, Ten Hag said: \"Always.\"He can score goals and he is valuable for us. We need him, that is clear. I think I have said enough about this situation.\"Ronaldo is contracted to Manchester United until next summer but has been linked with moves away from the club before then.French giants Paris St-Germain have been suggested as a possible destination, although it has been claimedexternal-link that looks unlikely. A move to Major League Soccer has been seen as another potential option, while a return to former club Sporting Lisbon has also been said to have been mooted.external-link'Focus has to be on an exit strategy' - analysisBBC Sport's Simon Stone: Ronaldo has done all the right things since he stormed out of Old Trafford after refusing to come on in the final minutes against Tottenham last week.But the fundamental issue remains. At 37, Ronaldo wants to play. He feels he is still capable of operating at the highest level and can make a meaningful contribution to big matches.On the other side, Erik ten Hag is trying to create a team who can dominate possession and press high up the field in the modern style.The two parts of that jigsaw simply do not go together.Ronaldo feels there were offers to leave in the summer, as he wanted to do. United say there simply weren't, other than one from Saudi Arabia, or at least none that wouldn't have involved them continuing to pay a hefty percentage of his salary.United now have six games to play before the World Cup. Ronaldo needs game time. Given this week's events, it suits everyone for the player to keep his composure and manager to use the highest-paid member of his squad.But the focus now has to be on an exit strategy.There were people at United in the summer who felt the dressing room would be better without Ronaldo. The events of this week show the evidence for that.It is also true that, in a better side than United at delivering the ball in the right areas for a striker, Ronaldo could still be a very effective performer.Beyond the next three weeks, it is better for both sides to see if they can prosper without each other, even if that means United paying up part of Ronaldo's salary, or the player walking away without part of what he is owed.Our coverage of Manchester United is bigger and better than ever before - here's everything you need to know to make sure you never miss a momentEverything United - go straight to all the best content"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joseph Zucker","title":"Orlando Pride Coaches Amanda Cromwell, Sam Greene Fired by NWSL After Investigation","description":"The NWSL <a href=\"https://www.nwslsoccer.com/news/national-womens-soccer-league-announces-results-of-orlando-pride-investigation\">announced</a> Monday...","url":"https://bleacherreport.com/articles/10051941-orlando-pride-coaches-amanda-cromwell-sam-greene-fired-by-nwsl-after-investigation","urlToImage":"https://media.bleacherreport.com/image/upload/x_0,y_19,w_1764,h_1176,c_crop/c_fill,g_faces,w_3800,h_2000,q_95/v1665434644/r4ngdfny5odpwagb8woq.jpg","publishedAt":"2022-10-10T21:07:22Z","content":"Jeremy Reper/ISI Photos/Getty Images\r\nThe NWSL announced Monday that Orlando Pride head coach Amanda Cromwell and assistant coach Sam Greene have been relieved of their duties following an investigat… [+2973 chars]","fullContent":"October 10, 2022Jeremy Reper/ISI Photos/Getty ImagesThe NWSL announced Monday that Orlando Pride head coach Amanda Cromwell and assistant coach Sam Greene have been relieved of their duties following an investigation into allegations of workplace misconduct.The league said it opened an inquiry into allegations of \"verbal abuse and improper favoritism towards players\" by Cromwell and \"improper favoritism towards players\" by Greene.The two allegedly retaliated against players who supported and took part in the investigation:\"Based on a thorough investigation conducted by the NWSL/NWSLPA Joint Investigative Team, these allegations were substantiated. The NWSL/NWSLPA Joint Investigative Team found that Cromwell and Greene engaged in retaliation and attempted retaliation against Pride players whom Cromwell and Greene believed had made or supported earlier misconduct allegations against them, in violation of League policy. Specifically, Cromwell and Greene were found to have engaged in conduct that discouraged reporting and fostered a general fear of retaliation, and to have taken negative actions against certain players, including by seeking to waive or trade them.\"Orlando issued a statement saying it \"supports the actions taken by the National Women's Soccer League\":Orlando Pride @ORLPrideStatement From Orlando Pride Chairman Mark Wilf (1/2) <a href=\"https://t.co/YDslGaPG1x\">pic.twitter.com/YDslGaPG1x</a>Cromwell addressed the announcement and said she was \"saddened and disappointed by the results of the NWSL's investigation. She added her \"character and integrity have been mischaracterized\":Amanda Cromwell @Cromwell_Coach<a href=\"https://t.co/TvuZoBqLLd\">pic.twitter.com/TvuZoBqLLd</a>The NWSL also cited Orlando goalkeeping coach Aline Reis for attempting to impede the investigation and \"pressuring players to share favorable information with investigators.\" The league placed Reis on unpaid administrative leave.Monday's announcement noted Cromwell, Greene, Reis and Pride assistant Michelle Akers during the investigation \"raised complaints that they were subjected to various forms of misconduct.\" Per the league, a third-party investigator was unable to substantiate the claims.In addition to their firings, Cromwell and Greene will be unable to take another job within the NWSL without the commissioner's approval. They have to complete training on \"retaliation, discrimination, harassment and bullying\" before the commissioner can decide on their status.The Pride hired Cromwell in December 2021. Seb Hines took over as interim coach when she and Greene were placed on administrative leave in June with the investigation ongoing.This comes amid a wider reckoning across the league.The United States Soccer Federation commissioned a report from former U.S. deputy attorney general Sally Q. Yates, which was released Oct. 3. Yates wrote that \"abuse and misconduct—verbal and emotional abuse and sexual misconduct—had become systemic, spanning multiple teams, coaches, and victims\" within the NWSL.U.S. Soccer announced a number of steps have been put in place to address the structural issues moving forward.🚨 SPORTS NEWS ➡️ YOUR INBOXThe latest in the sports world, emailed daily."},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Adam Wells","title":"NWSL Commissioner Says Additional Abuse Allegations Have Been Made Since Yates Report","description":"More allegations of abuse within women's professional soccer have come to light since the Yates report was released on Oct. 3. Appearing on CNN's <i>New</i>","url":"https://bleacherreport.com/articles/10051692-nwsl-commissioner-says-additional-abuse-allegations-have-been-made-since-yates-report","urlToImage":"https://media.bleacherreport.com/image/upload/c_fill,g_faces,w_3800,h_2000,q_95/v1665250132/ldazqicxcpw40pw8xlq0.jpg","publishedAt":"2022-10-08T17:41:40Z","content":"Tim Nwachukwu/Getty Images\r\nMore allegations of abuse within women's professional soccer have come to light since the Yates report was released on Oct. 3.\r\nAppearing on CNN's New Day with Brianna Kei… [+361 chars]","fullContent":"October 8, 2022Tim Nwachukwu/Getty ImagesMore allegations of abuse within women's professional soccer have come to light since the Yates report was released on Oct. 3.Appearing on CNN's New Day with Brianna Keilar, United States Soccer Federation president Cindy Parlow Cone revealed at least three new allegations of misconduct have emerged.Cone didn't provide any details of the new cases, but she did note the release of the Yates report has been \"encouraging more people to come forward.\"U.S. Soccer announced in October 2021 it retained Sally Yates, former U.S. attorney general, to lead an independent investigation into allegations of abusive behavior and sexual misconduct throughout women's professional soccer in the United States.In the final report released this week, Yates' investigation found abuse and misconduct in the NWSL had become \"systemic, spanning multiple teams, coaches, and victims.\"Other key takeaways from Yates' report include structural issues within the NWSL since it launched in 2012 without \"the most basic of workplace protections\" and ruled the U.S. Soccer Federation \"gave little thought or attention to basic player protections\" in order to maintain the league's existence.Responding to the report, U.S. Soccer announced next steps that include creating a committee of the board of directors to develop a plan of action based on Yates' recommendations and establish an office of participant safety to oversee the organization's conduct policies and reporting mechanisms.U.S. Soccer @ussoccerToday, U.S. Soccer released the full findings and recommendations of Sally Q. Yates’ independent investigation and announced plans to immediately work to implement those recommendations in collaboration with U.S. Soccer members at all levels of the game » <a href=\"https://t.co/deNMfKPxYK\">https://t.co/deNMfKPxYK</a> <a href=\"https://t.co/2i3Mn92wDA\">pic.twitter.com/2i3Mn92wDA</a>Parlow Cone told Keilar she has forwarded the new reports of misconduct to the U.S. Center for SafeSport and other authorities.Prior to their friendly on Friday, the U.S. and England women's national teams stood together with a banner reading \"protect the players.\"In November 2021, U.S. women's national team star Christen Press told Molly Hensley-Clancy of the Washington Post she approached then-U.S. Soccer Federation president Sunil Gulati about a \"toxic environment\" generated by Rory Dames, her coach with the Chicago Red Stars, in 2018.According to Press, Gulati \"dismissed her concerns\" and made attempts to normalize Dames' behavior. Dames resigned his position with Chicago amid multiple allegations of emotional and verbal abuse.In addition to multiple allegations against of abusive behavior against Dames, Yates' report also focused on similar allegations against former Portland Thorns coach Paul Riley and former Racing Louisville head coach Christy Holly, who were both also accused of sexual coercion and misconduct.Merritt Paulson, owner of the Thorns, and Arnim Whisler, owner of the Red Stars, announced they were relinquishing control of their clubs. Neither one has given an indication they will sell the teams.🚨 SPORTS NEWS ➡️ YOUR INBOXThe latest in the sports world, emailed daily."},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"LAFC and Philadelphia reach first MLS Cup final","description":"Los Angeles FC and Philadelphia Union reach the Major League Soccer cup final for the first time.","url":"https://www.bbc.co.uk/sport/football/63454432","urlToImage":"https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/1400D/production/_127433918_gettyimages-1244364812.jpg","publishedAt":"2022-10-31T08:46:22Z","content":"Cory Burke, left, joined Philadelphia Union in 2017\r\nLos Angeles FC and Philadelphia Union have reached the Major League Soccer cup final for the first time.\r\nUnion beat defending champions New York … [+1402 chars]","fullContent":"Cory Burke, left, joined Philadelphia Union in 2017Los Angeles FC and Philadelphia Union have reached the Major League Soccer cup final for the first time.Union beat defending champions New York City FC 3-1 in the Eastern Conference final.LAFC, who left Gareth Bale on the bench, beat Austin 3-0 in the Western Conference final and claimed the Supporters Shield - awarded to the team with the best regular season record.The final is on 5 November at LAFC's Banc of California Stadium.\"Our guys did an emphatic job,\" LAFC manager Steve Cherundolo said.\"That was the best I have seen implementing our match play from the beginning to the end. I'm very proud of the guys, but what I experienced in the locker room was hunger and a want for more.\"LAFC, whose team included former Italy and Juventus defender Giorgio Chiellini and ex-Arsenal striker Carlos Vela, opened the scoring through Cristian Arango. Austin's Maximiliano Urruti then scored an own goal before Kwadwo Opoku sealed the win.In the East, Maxi Moralez put New York ahead in the 57th minute but Union then scored three goals in 11 minutes through Julian Carranza, Daniel Gazdag and Cory Burke.The city of Philadelphia is enjoying widespread sporting success with the baseball team the Phillies in the World Series and the Eagles the only unbeaten team in the NFL.\"It's a special time right now in Philadelphia for a lot of reasons,\" Union coach Jim Curtin said. \"But these guys showed they are right up there with the Phillies and Eagles and it's great to see the sport grow this much in this city. I am really proud.\"Our coverage of your Premier League club is bigger and better than ever before - follow your team and sign up for notifications in the BBC Sport app to make sure you never miss a moment"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joseph Zucker","title":"Indianapolis HS Volleyball Team Subjected to Racist Gestures from Opposing Player","description":"Volleyball players from Pike High School in Indianapolis allege they were subjected to racist taunts from an opposing player, according to the <i>Indianapolis...","url":"https://bleacherreport.com/articles/10052162-indianapolis-hs-volleyball-team-subjected-to-racist-gestures-from-opposing-player","urlToImage":"https://media.bleacherreport.com/image/upload/x_116,y_23,w_1683,h_1122,c_crop/c_fill,g_faces,w_3800,h_2000,q_95/v1665586852/ijndixi1amhdzeyxsxlu.jpg","publishedAt":"2022-10-12T15:24:34Z","content":"Mark Alberti/Icon Sportswire via Getty Images\r\nVolleyball players from Pike High School in Indianapolis allege they were subjected to racist taunts from an opposing player, according to the Indianapo… [+1383 chars]","fullContent":"October 12, 2022Mark Alberti/Icon Sportswire via Getty ImagesVolleyball players from Pike High School in Indianapolis allege they were subjected to racist taunts from an opposing player, according to the Indianapolis Star's Kyle Neddenriep and Brian Haenchen.\"A video from the match Saturday obtained by IndyStar appears to show a New Palestine player scratching or beating her chest after a timeout and on the court with her teammates before play restarted,\" Neddenriep and Haenchen reported.Pike athletic director Kendra Champion-McAloon provided a statement.\"I don’t want to go into a lot of details, but one of our players made a report and we’ve been in contact with New Palestine and were told that they are investigating and taking it seriously,\" she said.According to the report, a Pike player who was serving as a line judge left the court after seeing the Palestine player's gestures.New Palestine athletic director Al Cooper and principal Jim Voelz told the Indianapolis Star the player in question has been disciplined based on what's outlined in the school's code of conduct.The Indiana High School Athletic Association confirmed to Neddenriep and Haenchen it was \"aware of the incident\" and \"believe that appropriate disciplinary action and proactive measures to correct unacceptable behavior are underway.\"Monkey chants are particularly prominent in world soccer and almost universally considered a form of racist abuse. In March, officials from Buchanan High School in California said a Black player was the target of monkey chants in a state championship soccer match.🚨 SPORTS NEWS ➡️ YOUR INBOXThe latest in the sports world, emailed daily."},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: USA hosts for first time","description":"Soccer rocked the USA in moment No. 20 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-usa-hosts-for-first-time","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/08.25.22_101-Most-Memorable-WC-Moments_20_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-01T23:03:32Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+1961 chars]"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Scott Polacek","title":"Pacific Forfeits BYU Volleyball Match, Cites Duke's Allegations of Racist Comments","description":"The University of the Pacific volleyball team chose to accept a forfeit rather than play at BYU after Duke volleyball player Rachel Richardson said she was...","url":"https://bleacherreport.com/articles/10055109-pacific-forfeits-byu-volleyball-match-cites-dukes-allegations-of-racist-comments","urlToImage":"https://media.bleacherreport.com/image/upload/c_fill,g_faces,w_3800,h_2000,q_95/v1667939194/tkkj3yktvjyb5yd7yqde.jpg","publishedAt":"2022-11-08T20:41:18Z","content":"Keith Lucas/NCAA Photos/NCAA Photos via Getty Images\r\nThe University of the Pacific volleyball team chose to accept a forfeit rather than play at BYU after Duke volleyball player Rachel Richardson sa… [+2265 chars]","fullContent":"November 8, 2022Keith Lucas/NCAA Photos/NCAA Photos via Getty ImagesThe University of the Pacific volleyball team chose to accept a forfeit rather than play at BYU after Duke volleyball player Rachel Richardson said she was subjected to racial slurs from a Cougars fan during an August match.\"The volleyball team has decided to not play the November 10 game at BYU,\" Pacific's senior communications director Mike Klocke said in a statement, per Analis Bailey of USA Today. \"The team expressed concerns following reports of racist and hostile comments during an August 26 match. Pacific stands with our student-athletes.\"Bailey noted BYU said it found no evidence of the racist comment during its own investigation, which it highlighted in its response.\"The University of the Pacific's decision to forfeit this week's women's volleyball match is unwarranted and deeply disappointing,\" the statement said. \"Following the Aug. 26 allegation, BYU conducted an extensive review and found no evidence to corroborate this allegation.\"Yet Richardson, who is Black, said she repeatedly heard a slur from the student section during the match, per ESPN's Adam Rittenberg. BYU initially banned a fan from attending athletic events but reversed that decision following its investigation.Duke athletic director Nina King released a statement supporting Richardson and the volleyball team after BYU made its announcement. Richardson's godmother, Lesa Pamplin, was not swayed by BYU's determination either.\"BYU's statement today does not change my position,\" Pamplin said. \"In fact, the statement and the 'findings' are in keeping with what I—and many others—anticipated.\"Daily across America, the burden of proof—in instances like these involving people of color, as well as marginalized people, economically disadvantaged people, and disempowered people—is shifted unfairly and without hesitation.\"As Bailey pointed out, the University of the Pacific volleyball team wasn't the only one to respond across the college sports landscape.Some USC women's soccer players said they were subjected to racial slurs from BYU fans in 2021 when they protested systemic inequality and police brutality by kneeling during the national anthem.South Carolina women's basketball coach Dawn Staley canceled a scheduled series with the Cougars, saying \"the incident at BYU has led me to reevaluate our home-and-home, and I don't feel that this is the right time for us to engage in this series.\"🚨 SPORTS NEWS ➡️ YOUR INBOXThe latest in the sports world, emailed daily."},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Alex Windley","title":"Predicting the USMNT's 26-man Roster in Qatar 1 Month from Now","description":"The 2022 FIFA World Cup will officially kick off a month from today. As 32 countries strive for glory, the United States Men's National Team will look to make...","url":"https://bleacherreport.com/articles/10052801-predicting-the-usmnts-26-man-roster-in-qatar-1-month-from-now","urlToImage":"https://media.bleacherreport.com/image/upload/c_fill,g_faces,w_3800,h_2000,q_95/v1666110910/wjzxy4fsedlbldyl7fkw.jpg","publishedAt":"2022-10-21T12:44:10Z","content":"Lars Baron/Getty Images\r\n<ol><li>Walker Zimmerman</li><li>Aaron Long</li><li>Cameron Carter-Vickers</li><li>Mark McKenzie</li><li>Tim Ream</li></ol>Since the injury to Miles Robinson on May 7, the US… [+2330 chars]","fullContent":"October 21, 2022Predicting the USMNT's 26-man Roster in Qatar 1 Month from Now0 of 6Christof Koepsel/Getty ImagesThe 2022 FIFA World Cup will officially kick off a month from today.As 32 countries strive for glory, the United States men's national team will look to make its mark on the world stage after missing the tournament four years ago.The 26 men tasked with this effort will be up to the discretion of head coach Gregg Berhalter.Throughout the World Cup Qualifying cycle, there has been much debate about Berhalter's propensity to stick with certain players despite them not being in form.With the World Cup looming, the lack of goals, mounting injuries and a poor end to its warm-up games, there is cause for concern for the USMNT.B/R Football @brfootballZero goals scored in their final two warm-up games.<br><br>USMNT fans heading into the World Cup: <a href=\"https://t.co/iAG8pbFfg0\">pic.twitter.com/iAG8pbFfg0</a>As the days count down to kickoff, who will be on the plane to Qatar in a month's time?Goalkeepers1 of 6ANP via Getty ImagesMatt Turner Zack Steffen Sean JohnsonThough Berhalter's player selection can be confusing, the goalkeeping spot should be self-explanatory.Without a doubt, Matt Turner is the starter heading into the tournament. Not only is he getting meaningful minutes with Arsenal in the Europa League, most recently clocking in three consecutive clean sheets, but his last time out with the USMNT also showed that he's more than capable of making big saves when called into action.B/R Football @brfootballBack-to-back clean sheets for Matt Turner 💪 <a href=\"https://t.co/scPYrnuC8R\">pic.twitter.com/scPYrnuC8R</a>Behind him will most likely be Zack Steffen. Since going out on loan to Middlesbrough, the 27-year-old has made the most of his opportunity.Injuries aside, Steffen has frequently been involved with the USMNT despite losing his starting job. He's a reliable backup and solid second string to Turner.Taking the final spot could be Sean Johnson.As of late, the NYCFC captain has been in solid form, helping his team get past Inter Miami in the opening round of the MLS Cup PlayoffsFOX Soccer @FOXSoccerWhat an effort by Taylor 👀<br><br>What a save by Sean Johnson 🇺🇸 <a href=\"https://t.co/aJ50ylJqcy\">pic.twitter.com/aJ50ylJqcy</a>Johnson has the second-most clean sheets in MLS and has maintained a 66.7 percent save percentage throughout the season.Certainly, more than good enough to board the plane in November.Center backs2 of 6Lars Baron/Getty ImagesWalker ZimmermanAaron LongCameron Carter-VickersMark McKenzieTim ReamSince the injury to Miles Robinson on May 7, the USMNT's center back crisis has become slightly more complicated.Walker Zimmerman and Aaron Long have largely been the first-choice pairing since Robinson's injury. Heading into Qatar, Berhalter will more than likely continue to use the duo, despite concerns about their defensive positioning and recovery speed.Major League Soccer @MLSIt had to be him! 👀<br><br>Brandon Vazquez gives <a href=\"https://twitter.com/fccincinnati?ref_src=twsrc%5Etfw\">@fccincinnati</a> the lead late. <a href=\"https://twitter.com/hashtag/RBNYvCIN?src=hash&amp;ref_src=twsrc%5Etfw\">#RBNYvCIN</a> // Audi <a href=\"https://twitter.com/hashtag/MLSCupPlayoffs?src=hash&amp;ref_src=twsrc%5Etfw\">#MLSCupPlayoffs</a> <a href=\"https://t.co/JwLhiPM9nV\">pic.twitter.com/JwLhiPM9nV</a>Behind them will probably be the likes of Cameron Carter-Vickers, Mark McKenzie and perhaps a surprise inclusion of Tim Ream.Carter-Vickers has been constant in Celtic's backline in both the Champions League and their regular-season matches. With a dwindling center back pool to choose from, the 25-year-old deserves a shot at starting given his current form.While taking a player like Chris Richards would be helpful, unfortunately the Crystal Palace defender has struggled with injuries and hasn't featured for his club since Aug. 27. In his place could be former Philadelphia Union defender Mark McKenzie.McKenzie was included and played in the last two warm-up games. If Richards is still not fit in a month, McKenzie would be the natural replacement.Lastly, though it would be a shock inclusion, Tim Ream's form alone should see him included on the final roster. The 35-year-old has been a rock in Fulham's defense and one of the most in-form American center backs playing in Europe. Berhalter should undoubtedly give the St. Louis native another look.Fulham Football Club @FulhamFC▪️ 100% aerial duels won.<br>▪️ Most passes into the final third (17).<br>▪️ Dribbled past = 0 times.<br><br>Ladies and gentlemen... <a href=\"https://twitter.com/timream5?ref_src=twsrc%5Etfw\">@timream5</a>! 🇺🇸<a href=\"https://twitter.com/hashtag/FFC?src=hash&amp;ref_src=twsrc%5Etfw\">#FFC</a> <a href=\"https://t.co/OsECeFw2y4\">pic.twitter.com/OsECeFw2y4</a>Full backs3 of 6John Dorton/ISI Photos/Getty ImagesSergiño DestDeAndre YedlinAntonee RobinsonJoe ScallyThere are four options at fullback that would make the most sense going into Qatar. At right-back, Sergiño Dest is the first choice. Though his time at AC Milan has seen him make just six appearances, he's still a lock for the starting job.Inter Miami defender DeAndre Yedlin will bring World Cup experience to a young locker room and still has the recovery speed to defend comfortably against quick opposition if needed.At left back, Antonee Robinson is a no-brainer. His speed and crossing ability is key to the way Berhalter likes to tactically set up his teams. He missed the most recent internationals through injury, but with him having returned for Fulham, expect Robinson to be the first name on the team sheet.Behind him could be Joe Scally.Yes, he is a right-back by trade, but with the lack of true options at left back, he could make it on the plane solely for his capability of playing on both flanks.Central Midfielders4 of 6Brad Smith/ISI Photos/Getty ImagesTyler AdamsWeston McKennieYunus MusahKellyn AcostaLuca de la TorreThe central midfielders for the USMNT are straightforward. The starting trio will be Tyler Adams, Weston McKennie and Yunas Musah.The question is who will be added to the depth chart behind them.In all likelihood, Kellyn Acosta and Luca de la Torre will round out the central midfield spots.Acosta is one of Berhalter's go-to players. He's been extraordinarily consistent during his time with the USMNT, is a serviceable backup to Tyler Adams and can start if someone in the midfield picks up an injury.De la Torre's inclusion in the last U.S. camp was a big indicator of Berhalter's plans, and the U.S. has enough midfield depth that a player like De la Torre, who would normally be on the fringes, would be a welcome addition.Don't expect the midfield to be up for much dispute, though. McKennie, Adams and Musah have proved that they work well together, and the addition of any other players won't threaten to break up that trio.Wingers, Attacking Midfielders5 of 6Aitor Alcalde/Getty ImagesChristian PulisicGiovanni ReynaBrenden AaronsonTimothy WeahPaul ArriolaJordan MorrisIt's safe to say that Christian Pulisic, Giovanni Reyna, Brenden Aaronson and Timothy Weah are the presumed starters/first-string players on the wing.Any spots after those four are up for debate.They may not be fan favorites, but there is a chance that Paul Arriola and Jordan Morris get picked for the final roster.Both Morris and Arriola work hard, have a knack for finding themselves in attacking positions and possess speed that is valuable in the 4-3-3. They could easily be on the plane to Qatar based on that alone.It's not a popular choice, but Berhalter is going be practical and stick with what he knows.Strikers6 of 6Omar Vega/Getty ImagesRicardo PepiJesus FerreiraJosh SargentNo other position has been discussed more than the starting striker spot for the USMNT.All the conjecture aside, this is the one spot where Berhalter hasn't wavered.It's evident based on his tactical preferences that Ricardo Pepi, Jesus Ferreira and Josh Sargent will be on the final roster.Even with the shouts to bring in guys like Jordan Pefok and Brandon Vazquez, the pair sadly missed their opportunity when they weren't called up to the USMNT's last two warm-up games.Fortunately, for all the worrying about who could start in Qatar, Pepi has begun to regain his form for FC Groningen, scoring his fifth goal in six games on Wednesday.Men in Blazers @MenInBlazersPEPI GOAL 🇺🇸 🚂 The 19-year-old’s fifth goal in six matches since joining Groningen. He won’t score many easier than this, but his press forces the initial turnover. And he then continues his run. El Paso hero doing work in 🇳🇱.<a href=\"https://t.co/JdOKDJl8jY\">pic.twitter.com/JdOKDJl8jY</a>Ferreira and Sargent haven't been slouches for their club teams, either. Sargent is the joint-leading Championship scorer with eight goals for Norwich, and FC Dallas' Ferreira won MLS Young Player of the Year.🚨 SPORTS NEWS ➡️ YOUR INBOXThe latest in the sports world, emailed daily."},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Scott Polacek","title":"PGA Tour Files Suit Against LIV's Saudi Financial Backers in Federal Court","description":"The latest chapter in the legal back-and-forth between the PGA Tour and LIV Golf began Thursday. According to ESPN's <a...","url":"https://bleacherreport.com/articles/10053157-pga-tour-files-suit-against-livs-saudi-financial-backers-in-federal-court","urlToImage":"https://media.bleacherreport.com/image/upload/c_fill,g_faces,w_3800,h_2000,q_95/v1666361066/dlonb15ibvtbqqmnz1hl.jpg","publishedAt":"2022-10-21T14:10:06Z","content":"Ben Jared/PGA TOUR via Getty Images\r\nThe latest chapter in the legal back-and-forth between the PGA Tour and LIV Golf began Thursday.\r\nAccording to ESPN's Mark Schlabach, the PGA Tour filed a federal… [+2174 chars]","fullContent":"October 21, 2022Ben Jared/PGA TOUR via Getty ImagesThe latest chapter in the legal back-and-forth between the PGA Tour and LIV Golf began Thursday.According to ESPN's Mark Schlabach, the PGA Tour filed a federal lawsuit in the U.S. District Court for the Southern District of New York in Manhattan. The lawsuit was filed against LIV Golf's financier, Saudi Arabia's Public Investment Fund, and its governor, Yasir Othman Al-Rumayyan.The PGA Tour's goal in the latest filing is to obtain a motion to compel from a federal judge, which would require Al-Rumayyan to be deposed as part of another federal lawsuit involving the two golf leagues and for documents to be available to the PGA Tour's lawyers through discovery.Schlabach provided something of a timeline to the proceedings, noting the U.S. Department of Justice is investigating the PGA Tour for alleged monopolistic actions after 11 LIV Golf players filed a federal antitrust lawsuit against it on Aug. 3.While eight of the 11 players asked to be removed from the case, Bryson DeChambeau, Matt Jones and Peter Uihlein all remain plaintiffs.The PGA Tour—which suspended more than 30 players after they competed in LIV Golf events without releases—responded by countersuing LIV Golf on Sept. 29 and alleging it interfered with ongoing contracts of players.The emergence of LIV Golf was a dominant storyline in the golf world throughout the year, as notable players such as Dustin Johnson, Cameron Smith, Phil Mickelson, Brooks Koepka, Sergio Garcia and DeChambeau joined the new organization despite pressure and suspensions from the PGA Tour.Hovering over the discourse is the reality that financial backing from Saudi Arabia's Public Investment Fund opens LIV Golf up to plenty of criticism.Saudi Arabia's efforts in the golf world have been classified by many as sportswashing, which uses entertainment such as sports teams and leagues to distract from human rights abuses and other more serious issues.In addition to his role with LIV Golf, Al-Rumayyan is chairman of the English soccer team Newcastle United.LIV Golf went through with its first series of events in the face of that criticism this year, and Dustin Johnson took home the season-long individual title.While the events continue on the course, it seems as if the legal battles will also remain ongoing for some time between the two golf leagues.🚨 SPORTS NEWS ➡️ YOUR INBOXThe latest in the sports world, emailed daily."},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Stu Holden's top 50 players at World Cup 2022","description":"FOX Sports soccer analyst Stu Holden counts down his picks for the 50 best players at the 2022 World Cup in Qatar.","url":"https://www.foxsports.com/stories/soccer/stu-holdens-top-50-players-at-world-cup-2022","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/Stus-Top-50-World-Cup-Players-Landing-Page_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-10T21:26:13Z","content":"In November, up to 832 of the best soccer players in the world will travel to Qatar with the hope of lifting the World Cup for their country. Of that group, there's a clear top tier.\r\nTo prepare for … [+1460 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"USMNT Stock Watch: Gio Renya, Antonee Robinson return from injury","description":"The USMNT's World Cup roster is starting to take shape with star players returning from injury. Doug McIntyre recaps the week in club soccer.","url":"https://www.foxsports.com/stories/soccer/usmnt-stock-watch-gio-renya-antonee-robinson-return-from-injury","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/10.11.22_Plane-to-Qatar_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-12T00:44:49Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's Note: \"Plane to Qatar\" is FOX Sports' weekly feature tracking the progress of players hoping to crack the United States\r\n Men's National Team's 26… [+8317 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Marc Skinner: Manchester United boss says players and coaches must 'call out misbehaviour' after NWSL report","description":"Manchester United boss Marc Skinner says players and coaches must \"call out misbehaviour\" after a report found abuse was 'systemic' in the NWSL.","url":"https://www.bbc.co.uk/sport/football/63227634","urlToImage":"https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/EE26/production/_127066906_marcskinner.jpg","publishedAt":"2022-10-12T14:54:47Z","content":"Skinner managed Orlando Pride in the NWSL between 2019 and 2021\r\nManchester United boss Marc Skinner says coaches and players must continue to \"call out misbehaviour\" following an investigation into … [+1598 chars]","fullContent":"Skinner managed Orlando Pride in the NWSL between 2019 and 2021Manchester United boss Marc Skinner says coaches and players must continue to \"call out misbehaviour\" following an investigation into abuse in the National Women's Soccer League (NWSL).The investigation, published earlier this month, found abuse \"had become systemic\" in the United States' NWSL.Skinner, who coached Orlando Pride before taking over at United in 2021, called the report a \"tough read\".\"We need to show support and solidarity at this moment,\" Skinner said.\"We have to continue to change, adapt and evolve to make sure nobody goes through this. \"We cannot allow any player, any staff or anyone involved in the work place to go through this.\"An independent investigation was launched last year following allegations made against North Carolina Courage's English head coach Paul Riley, who was sacked.As well as examining claims against Riley, who denies the accusations, the report looks into allegations against two other coaches, American Rory Dames and Northern Irishman Christy Holly.Following a separate investigation, Orlando Pride's head coach Amanda Cromwell and assistant coach Sam Greene were sacked on Monday after \"engaging in retaliatory conduct\" towards players who had complained about them in a previous investigation.Skinner praised players' and coaches' \"bravery\" for speaking out against abuse and misconduct>\"It's important coaches and players continue to call out misbehaviour,\" added Skinner.\"That's how we can continue to evolve this conversation and not just see it as a moment in time.\"Anybody involved in the responsibility of a vulnerable adult or children coming into the game, we have to be responsible, speak up and not allow others to go through the same thing.\"When is a criminal no longer a threat? Bad People considers when offenders should be releasedHow to fool the opposition in sport effectively: Sideways dives into the world of deception"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"USMNT World Cup Prediction: Staff picks for 26-man roster","description":"The USMNT's World Cup roster will be revealed on Wednesday; here's what FOX Sports' soccer experts think it will look like.","url":"https://www.foxsports.com/stories/soccer/usmnt-world-cup-prediction-staff-picks-for-26-man-roster","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/11.04.22_StaffPicksUSMNTRoster_Horizontal-1.jpg?ve=1&tl=1","publishedAt":"2022-11-05T01:12:35Z","content":"The United States men's national team's opening game of the 2022 FIFA World Cup in Qatar is Nov. 21 against Wales, but the roster reveal is even closer. On Wednesday, Gregg Berhalter will name his 26… [+3906 chars]","fullContent":"   The United States men's national team's opening game of the 2022 FIFA World Cup in Qatar is Nov. 21 against Wales, but the roster reveal is even closer. On Wednesday, Gregg Berhalter will name his 26-man squad for the tournament, and there are sure to be snubs and surprises.In anticipation of the full roster release, we asked our staff of writers here at FOX Sports — Laken Litman, Doug McIntyre and Martin Rogers — to make educated guesses as to who will be on the plane to Qatar later this month. While there we no disagreements at the top with players suc as Christian Pulisic, Weston McKennie and Tyler Adams, things got interesting on the roster's fringes, particularly at the striker position.[USMNT World Cup roster prediction: Alexi Lalas picks his 26-man roster]Let's get into it.CONSENSUS PICKS (22)Goalkeepers (3): Sean Johnson, Zack Steffen, Matt TurnerFull backs (5): Reggie Cannon, Sergiño Dest, Antonee Robinson, Joe Scally, DeAndre YedlinCenter backs (4): Cameron Carter-Vickers, Aaron Long, Mark McKenzie, Walker Zimmerman Midfielders (4): Kellyn Acosta, Tyler Adams, Weston McKennie, Yunus Musah Wingers (5): Paul Arriola, Brenden Aaronson, Christian Pulisic, Giovanni Reyna, Tim WeahStrikers (1): Jesús FerreiraLAKEN'S PICKSChris Richards (CB), Luca de la Torre (MF), Malik Tillman (MF), Josh Sargent (ST)The striker spot is a tricky one. Berhalter was criticized for excluding Jordan Pefok prior to the last window that included friendlies against Japan and Saudi Arabia. Pefok won the Golden Boot in the Swiss League last year and had been a top scorer for Union Berlin. But he hasn't scored in the past eight games. Even though Sargent recently injured his calf, he has been a solid contributor for Norwich City and scored eight goals in 17 games this season, so he gets the nod here.DOUG'S PICKSMalik Tillman (MF), Jordan Morris (RW), Ricardo Pepi (ST), Josh Sargent (ST)The fact that Aaronson, Pulisic and Reyna can also be deployed as central attacking midfielders opens the door for two more wide players: the defensively sound longtime national teamers Arriola and Morris.McKennie should be healthy by the time camp opens in Qatar; only an unexpected setback will keep the surefire starter home. Injured Luca de la Torre would be here if healthy, but his recovery timeline takes him all the way to the Americans Nov. 21 opener vs. Wales. Tillman, playing regularly in Scotland and in the Champions League, claims the final spot ahead of Cristian Roldan.[USMNT Stock Watch: McKennie injury puts pressure on midfield reserves]Pepi has been prolific since arriving in the Netherlands; he and Ferreira were both regulars throughout World Cup qualifying. Sargent is tied for second in scoring in England's Championship and is expected to be over his calf injury in time. Pefok wasn't a lock for Berhalter even when he was knocking in goals in Germany. He's now mired in a scoring drought that seals his fate. MARTIN'S PICKSLuca de la Torre (MF), Jordan Morris (RW), Ricardo Pepi (ST), Jordan Pefok (ST)With Sargent struggling with recent injury, Pefok makes it despite patchy recent form. And de la Torre gets the nod from Berhalter despite his own injury problems, the coach perhaps reasoning that his energetic impact could be useful toward the end of the group stage, or beyond.Laken Litman covers college football, college basketball and soccer for FOX Sports. She previously wrote for Sports Illustrated, USA Today and The Indianapolis Star. She is the author of \"Strong Like a Woman,\" published in spring 2022 to mark the 50th anniversary of Title IX. Follow her on Twitter @LakenLitman.Doug McIntyre is a soccer writer for FOX Sports. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports and he has covered United States men’s and women’s national teams at multiple FIFA World Cups. Follow him on Twitter @ByDougMcIntyre.Martin Rogers is a columnist for FOX Sports and the author of the FOX Sports Insider newsletter. Follow him on Twitter @MRogersFOX and subscribe to the daily newsletter.     Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: Müller seals second title for Germany","description":"Gerd Müller's final goal for Germany was the biggest of his international career. This is memorable moment No. 33.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-muller-seals-second-title-for-germany","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_33_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-18T22:04:55Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1119 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: Fabio Grosso bends it vs. Germany","description":"Fabio Grosso's curler sent Italy to the final in No. 39 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-fabio-grosso-bends-it-vs-germany","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/101-Most-Memorable-WC-Moments_39_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-12T22:38:45Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1442 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: Rijkaard spits at Voller","description":"Frank Rijkaard earned his red card in No. 43 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-rijkaard-spits-at-voller","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/101-Most-Memorable-WC-Moments_43_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-10T04:26:20Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1524 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"Top 50 players at World Cup 2022, No. 17: Thibaut Courtois","description":"Thibaut Courtois can leave behind any doubt that he's best goalkeeper in the world with a strong World Cup, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-world-cup-2022-no-17-thibaut-courtois","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/09.26.22_Top-50-World-Cup-Players_17_THIBAUT-COURTOIS_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-04T05:24:44Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players\r\n participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nThibaut Courtois \r\nCountr… [+716 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: Paolo Rossi scores hat-trick vs. Brazil","description":"Paolo Rossi marked his comeback with a hat-trick in No. 29 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-paolo-rossi-scores-hat-trick-vs-brazil","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_29_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-23T10:51:38Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1559 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Bale's 128th-minute goal helps LAFC win MLS Cup","description":"Gareth Bale scores a last-minute equaliser in extra time before LAFC beat Philadelphia Union to on penalties to win the MLS Cup.","url":"https://www.bbc.co.uk/sport/football/63531014","urlToImage":"https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/104FD/production/_127531866_garethbale.jpg","publishedAt":"2022-11-05T23:53:15Z","content":"Gareth Bale scored the last-ditch equaliser after coming off the bench in extra time\r\nGareth Bale scored a last-minute equaliser in extra time before Los Angeles FC beat Philadelphia Union on penalti… [+2867 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at 2022 World Cup, No. 42: Gareth Bale","description":"Gareth Bale can continue Wales' recent international success at his first World Cup, Stu Holden writes.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-2022-world-cup-gareth-bale","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.16.22_Top-50-World-Cup-Players_42_GARETH-BALE_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-10T07:11:16Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nGareth Bale\r\nCountry: Wales… [+830 chars]","fullContent":"   FOX Sports soccer analyst and former USMNT midfielder Stu Holden is counting down the 50 best players participating in the 2022 FIFA World Cup in Qatar. Up next is …Gareth BaleCountry: WalesRank: 42Rank in 2018: N/APosition: AttackerAge: 33Gareth Bale has accomplished just about everything a player can at the club level, including five Champions League titles and three domestic titles with Real Madrid. His most recent accomplishment was winning the Supporters' Shield with LAFC in his first season in MLS.Internationally, though, Bale hasn't experienced much success. This year, that could change for him and Wales.\"When you think about Wales standing there for Gareth Bale, his dream as a kid to represent his nation in a World Cup,\" Holden said. \"They do it for the first time since 1958, and they land themselves in a group against England, Iran and the United States. The LAFC man will be very familiar with American soccer by end of his time in MLS, but will we see him and Wales make some noise in Qatar?\"No. 42: Gareth Bale       \n    Wales' Gareth Bale is known for his technical ability, speed and finishing.\n      Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at 2022 World Cup, No. 43: Édouard Mendy","description":"Édouard Mendy will be one of the best goalkeepers at the 2022 World Cup in Qatar, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-2022-world-cup-edouard-mendy","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.16.22_Top-50-World-Cup-Players_43_EDOUARD-MENDY_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-10T06:50:55Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nÉdouard Mendy\r\nCountry: Sen… [+1003 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: The Saudi Maradona","description":"Saeed Al-Owairan did his best Maradona impression in No. 37 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-the-saudi-maradona","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_37_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-15T02:28:25Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1279 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at 2022 World Cup, No. 36: Antonio Rüdiger","description":"Antonio Rüdiger can make his second trip to the World Cup with Germany better than his last, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-2022-world-cup-no-36-antonio-rudiger","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.22.22_Top-50-World-Cup-Players_36_ANTONIO-RUDIGER_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-15T23:58:14Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nAntonio Rüdiger\r\nCountry: G… [+795 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at 2022 World Cup, No. 39: Christian Pulisic","description":"For the USMNT, the road to a successful return to the World Cup will go through Christian Pulisic, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-2022-world-cup-no-39-christian-pulisic","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.21.22_Top-50-World-Cup-Players_39_CHRISTIAN-PULISIC_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-13T03:18:37Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nChristian Pulisic\r\nCountry:… [+890 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: Portugal comeback vs. North Korea","description":"Portugal came back from 3-0 in No. 34 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-portugal-comeback-vs-north-korea","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_34_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-17T23:38:20Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1233 chars]","fullContent":"   By Doug McIntyreFOX Sports Soccer WriterEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continues with Portugal's spectacular comeback win vs. North Korea.North Korea had already become the first Asian team to reach the knockout stage of a World Cup, stunning two-time champion Italy — perhaps the biggest upset in tournament history — along the way.Now they were on their way to an even bigger shock over Portugal in the quarterfinals of the 1966 World Cup in England. Pak Seung-zin had given North Korea the lead before the game was 60 seconds old; by the 25th minute, it was 3-0 at Goodison Park in Liverpool.History would be made that day, all right. By Portugal. With the great Eusébio leading the way, the Portuguese roared back by scoring five consecutive goals, including four by the previous year’s Ballon d’Dor winner. The Portuguese would lose to the hosts (and eventual champs) in the semis, but the 5-3 victory over North Korea is still considered the greatest World Cup comeback of all time.One of the leading soccer journalists in North America, Doug McIntyre has covered United States men’s and women’s national teams at multiple FIFA World Cups. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: Götze denies Messi of trophy","description":"Mario Götze was the difference in Germany's World Cup final vs. Argentina in 2014. This is memorable moment No. 25.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-gotze-denies-messi-of-trophy","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_25_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-27T03:25:44Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1235 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"EA Sports FIFA 23 simulation forecasts Argentina to win 2022 World Cup","description":"Is this the year Lionel Messi and Argentina finally win the World Cup? Read here to see what EA Sports FIFA 23's simulation predicts.","url":"https://www.foxsports.com/stories/soccer/ea-sports-fifa-23-simulation-forecasts-argentina-to-win-2022-world-cup","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/11.08.22_EA-Sports-FIFA-Simulates-2022-World-Cup_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-08T23:44:08Z","content":"EA Sports FIFA, the world-famous soccer video game, has been pretty good at predicting World Cup winners lately.\r\nIn 2010, EA Sports used the FIFA game to simulate that year's World Cup tournament an… [+2051 chars]","fullContent":"   EA Sports FIFA, the world-famous soccer video game, has been pretty good at predicting World Cup winners lately.In 2010, EA Sports used the FIFA game to simulate that year's World Cup tournament and projected Spain to win it all. Sure enough, Spain eventually defeated the Netherlands in the real-life title game to win the country's first World Cup championship.When EA Sports did the same thing in 2014 and 2018, those predictions also came true, with Germany and France taking home the crown in both the virtual versions and the real-life editions weeks later.This time around, the EA Sports FIFA 23 simulation is predicting that Argentina will win the World Cup.Argentina is one of the betting favorites to win this year, currently tied for the third-shortest odds at +550 at FOX Bet to take home the trophy (bet $10 to win $65 total). A 2022 World Cup would be the crowning achievement for superstar Argentina team captain Lionel Messi, who has said that this upcoming World Cup would be his last. It would be even sweeter for Messi and Argentina if their title run unfolded exactly how FIFA 23 simulated — a 1-0 victory in the World Cup Final over archrival Brazil.The 35-year-old Messi is arguably the greatest soccer player of his generation, with nearly two decades of success at the storied European club FC Barcelona before moving to Paris Saint-Germain in 2021. However, Messi has never been able to capture a World Cup, coming closest when his team reached the 2014 final before losing to Germany. Argentina had not even won a major international soccer championship with Messi until he led the team to a Copa América title in 2021.Has Lionel Messi turned into BARCA MESSI with PSG?       \n    After Lionel Messi's impressive performance against Benfica in the Champions League, Alexi Lalas and David Mosse break down how Messi is consistently putting great performances for PSG.\n\n  FIFA's simulation also predicts Messi will be the tournament's top scorer with eight goals in seven matches. The game also predicts that he will make the 2022 World Cup Team of the Tournament along with teammates Emiliano Martínez, Marcos Acuña, Leandro Paredes and Rodrigo De Paul. The stacked Argentine roster has been on a stellar run of success in recent years, with its last loss coming in 2019.Can Argentina keep it going and finally give Messi that elusive World Cup title? Tune in to find out when the 2022 World Cup starts on Nov. 20 only on FOX, FOX Sports 1 and the FOX Sports App.    Get more from FIFA Club World Cup Follow your favorites to get information about games, news and more   in this topic  Argentina     "},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Women's Super League: Five talking points as Villa hope to extend unbeaten run","description":"Can Carla Ward's Aston Villa continue their unbeaten start to the season? Five talking points going into this weekend's games.","url":"https://www.bbc.co.uk/sport/football/63261230","urlToImage":"https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/C26F/production/_127157794_gettyimages-1429414617.jpg","publishedAt":"2022-10-14T17:33:21Z","content":"Aston Villa are already 46% of the way to their goal tally from last season having netted six goals so far\r\n<table><tr><th>Women's Super League - Manchester United v Brighton</th></tr>\r\n<tr><td>Venue… [+6149 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Orlando Pride head coach Amanda Cromwell and assistant coach sacked for 'retaliatory conduct'","description":"Orlando Pride head coach Amanda Cromwell and her assistant are sacked after \"engaging in retaliatory conduct\" towards players who had complained about them.","url":"https://www.bbc.co.uk/sport/football/63209393","urlToImage":"https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/9851/production/_127039983_whatsubject.jpg","publishedAt":"2022-10-10T22:57:11Z","content":"Amanda Cromwell won 55 caps for the United States as a player\r\nOrlando Pride head coach Amanda Cromwell and assistant coach Sam Greene have been sacked after \"engaging in retaliatory conduct\" towards… [+3070 chars]","fullContent":"Amanda Cromwell won 55 caps for the United States as a playerOrlando Pride head coach Amanda Cromwell and assistant coach Sam Greene have been sacked after \"engaging in retaliatory conduct\" towards players who had complained about them in a previous investigation.The United States' National Women's Soccer League (NWSL) said their conduct \"discouraged reporting and fostered a general fear of retaliation\".They also tried waive or trade certain players who they believed had made or supported misconduct allegations against them earlier in the year.It comes a week after an independent investigation found abuse and misconduct \"had become systemic\" in the NWSL.In a statement on Twitter, former United States international Cromwell said she was \"saddened and disappointed\" by the results of the NWSL's latest investigation, adding her character and integrity had been \"mischaracterised\".In March, allegations were made of \"verbal abuse\" towards players by Cromwell and of \"improper favouritism\" by both Cromwell and Greene. After an investigation, some of the claims were substantiated and both received written warnings, with Cromwell required to take part in leadership training.Two months later, the NWSL and NWSL Players Association's joint investigation team received reports that the pair were engaging in retaliatory conduct. The league says \"these allegations were substantiated\" by another investigation. The investigation team also found that goalkeeping coach Aline Reis - a former Brazil international - did not fully cooperate and was \"pressuring players to share favourable information with investigators\".In June, Cromwell, Greene, Reis and assistant coach Michelle Akers raised complaints that they were subjected to various forms of misconduct, claims that were found to be unsubstantiated by an NWSL-commissioned investigation by a third party.As a result of the investigation team's findings, the NWSL has terminated Cromwell's and Greene's contracts with immediate effect, while Reis has been placed on unpaid administrative leave and must take part in mandatory training regarding \"retaliation, discrimination, harassment and bullying\".Cromwell and Greene must complete the same training, as well as \"mandatory executive coaching\", if they hope to return to working in the NWSL. They will only be allowed to return to the NWSL if approved by the league's commissioner.Cromwell, 52, said that she would be \"reviewing all legal options\", saying the investigation was \"biased and incomplete\".\"As we continue to build a league as elite as the players on the pitch, it is critically important that we foster a culture where individuals can safely come forward with concerns without fear of reprisal,\" said NWSL commissioner Jessica Berman. \"These retaliation concerns were identified during the NWSL/NWSLPA joint investigation and interim measures were put in place due to the ongoing nature of the misconduct.\" Orlando Pride chairman Mark Wilf said: \"Our club is dedicated to providing a safe, inclusive and respectful environment, and we apologise to our players who may have experienced otherwise. \"We are committed to learning from this process as we continue to build and grow the Pride into the premier organisation our players and fans deserve.\""},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: Argentina 6, Peru 0","description":"Argentina routed Peru 6-0 in 1978, but was it a fair game? This is No. 44 on our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-argentina-6-peru-0","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/101-Most-Memorable-WC-Moments_44_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-08T22:12:44Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1553 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: Uruguay win the first World Cup","description":"Uruguay became the first-ever World Cup champion in No. 38 of our 101 most memorable World Cup moments.","url":"https://www.foxsports.com/stories/soccer/world-cup-101-most-memorable-moments-uruguay-win-the-first-world-cup","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/101-Most-Memorable-WC-Moments_38_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-14T03:32:31Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1360 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: Dos a Cero","description":"The USMNT beat their bitter rivals 2-0 in No. 36 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-dos-a-cero","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_36_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-15T23:22:16Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1591 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: England robbed of Frank Lampard goal","description":"Frank Lampard's goal didn't count in No. 31 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-england-robbed-of-frank-lampard-goal","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_31_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-21T07:31:32Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1544 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: England start penalty woes","description":"England's misfortune from the penalty spot all started with No. 41 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-england-start-penalty-woes","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/101-Most-Memorable-WC-Moments_41_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-10T22:53:20Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1420 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: Jorge Burruchaga wins it for Argentina","description":"Jorge Burruchaga sealed the World Cup for Argentina in moment No. 35 of our 101 most memorable moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-jorge-burruchaga-wins-it-for-argentina","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_35_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-16T22:18:10Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1439 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"USWNT lose to England, Spain: 3 takeaways from winless window","description":"The USWNT had a lot to deal with on and off the pitch in this month's window. Doug McIntyre's looks back at the last two matches.","url":"https://www.foxsports.com/stories/soccer/uswnt-lose-to-england-spain-3-takeaways-from-winless-window","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/rapinoe1.jpg?ve=1&tl=1","publishedAt":"2022-10-11T22:07:19Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nFour days after the United Sates women's national team fell to European champion England the Americans' first defeat in more than a year the USWNT suffered… [+4912 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: The Disgrace of Gijón","description":"Austria and West Germany were accused of match-fixing in No. 28 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-the-disgrace-of-gijon","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_28_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-23T23:12:00Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1306 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"World Cup's 101 Most Memorable Moments: Schumacher’s careless tackle","description":"Toni Schumacher should have been sent off for No. 26 on our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-schumachers-careless-tackle","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_26_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-25T22:51:55Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1443 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: The fantastic France-Croatia Final","description":"France and Croatia battled in No. 32 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-the-fantastic-france-croatia-final","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_32_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-20T07:46:38Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1449 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: David Beckham sees red vs. Argentina","description":"David Beckham's red could have been the difference for England in No. 40 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-david-beckham-sees-red-vs-argentina","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/101-Most-Memorable-WC-Moments_40_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-11T21:48:23Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1554 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: Roger Milla turns back clock","description":"Roger Milla had a spring in his step in No. 21 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-roger-milla-turns-back-clock","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/08.25.22_101-Most-Memorable-WC-Moments_21_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-01T19:40:46Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+1520 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: Ronaldo returns for 1998 Final","description":"Ronaldo had a health scare that shook Brazil in No. 30 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-ronaldo-returns-for-1998-final","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.23.22_101-Most-Memorable-WC-Moments_30_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-23T10:39:58Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1578 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Wednesday's gossip: Messi, Gundogan, Neves, Milinkovic-Savic, Kovacic","description":"Paris St-Germain want to extend Lionel Messi's deal, Bayern Munich eye Ilkay Gundogan, Barcelona open Ruben Neves talks, plus more.","url":"https://www.bbc.co.uk/sport/63390282","urlToImage":"https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/90BD/production/_127335073_messi_gossip.jpg","publishedAt":"2022-10-25T21:45:26Z","content":"Paris St-Germain want to extend Lionel Messi's contract by an additional 12 months. The 35-year-old Argentina forward's current deal is set to expire in June 2023. (Le Parisien - in French, subscript… [+2858 chars]","fullContent":"Paris St-Germain want to extend Lionel Messi's contract by an additional 12 months. The 35-year-old Argentina forward's current deal is set to expire in June 2023. (Le Parisien - in French, subscription required)external-linkBayern Munich are considering a move for Manchester City's 32-year-old Germany midfielder Ilkay Gundogan next summer. (90min)external-linkBarcelona are in talks to sign Portugal midfielder Ruben Neves, 25, from Wolves, with a deal believed to be possible in January. (Sport - in Spanish)external-linkChelsea could make a bid to sign Brazil midfielder Bruno Guimaraes, 24, from Newcastle, but the Magpies are hoping to fight off the interest by offering him a new club record contract. (Goal)external-linkJuventus are also keen on signing Guimaraes. (Calciomercato - in Italian)external-linkSporting Lisbon manager Ruben Amorim says everyone at the club \"dreams\" of Manchester United'sPortugal forward Cristiano Ronaldo returning to the club, however, the Portuguese side cannot afford the 37-year-old's wages. (Football.London)external-linkRonaldo's options of a move to the United States include Major League Soccer clubs Inter Miami, Los Angeles Galaxy and LAFC. (Los Angeles Times)external-linkArsenal are willing to offer Belgium midfielder Albert Sambi Lokonga, 23, as part of a deal to sign Lazio's Serbia midfielder Sergej Milinkovic-Savic, 27. (Calciomercato - in Italian) external-linkMeanwhile, Arsenal will back manager Mikel Arteta with £50m in the January transfer window in order to help their title bid. (Sun)external-linkChelsea are keen to begin contract talks with Croatia midfielder Mateo Kovacic, 28, after the World Cup. His current deal has less than two years remaining. (Evening Standard)external-linkVisit your Premier League club's page with all the latest news, analysis and fan views, and sign up for notificationsEngland midfielder Jude Bellingham, 19, could yet decide to stay at Borussia Dortmund next summer, despite interest from Liverpool and Real Madrid. (Sky Sports)external-linkLiverpool could use their Guinea midfielder Naby Keita, 27, to secure a deal for AC Milan and Italy midfielder Sandro Tonali, 22. (Express)external-linkLille striker Jonathan David, 22, says he would \"go for\" the chance to play for a \"massive club\". The Canada forward has been linked with a possible move to Chelsea, Arsenal or Manchester United. (Mirror)external-linkChelsea want Brighton's head of recruitment Paul Winstanley after bringing in technical directors Laurence Stewart, from Monaco, and Christopher Vivell, formerly of RB Leipzig, as well as ex-Southampton co-director of recruitment Joe Shields. (Guardian) external-linkManchester United are happy with the work being done by football director John Murtough amid speculation they are about to appoint former Liverpool director Michael Edwards in his role. (Express)external-linkArsenal have opened talks with technical director Edu over a new contract amid growing interest from European clubs. (Mail)external-linkLeicester City and Southampton are interested in signing 22-year-old Morocco forward Zakaria Aboukhlal from Toulouse. (Football Insider)external-linkLeicester'sEnglish midfielder James Maddison, 25, and Bayer Leverkusen's France winger Moussa Diaby, 23, are considered realistic January targets for Newcastle United. (Chronicle Live)external-linkNewly appointed Middlesbrough manager Michael Carrick says he will use his \"relationship\" with former club Manchester United to bring in players on loan. (Talksport)external-linkTuesday's gossip  Metro back page Our coverage of your Premier League club is bigger and better than ever before - follow your team and sign up for notifications in the BBC Sport app to make sure you never miss a moment"},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Newcastle United explore naming options for St James' Park","description":"Newcastle are exploring naming rights for St James' Park and whether to expand or build a new stadium, but will do so by consulting with fans, says chief executive Darren Eales.","url":"https://www.bbc.co.uk/sport/football/63241450","urlToImage":"https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/14F57/production/_127074858_gettyimages-1398457890.jpg","publishedAt":"2022-10-13T09:57:50Z","content":"St James' Park has already hosted a women's team game and will do so again in November\r\nNewcastle United are exploring naming rights for St James' Park and whether to expand or build a new stadium, b… [+2371 chars]","fullContent":"St James' Park has already hosted a women's team game and will do so again in NovemberNewcastle United are exploring naming rights for St James' Park and whether to expand or build a new stadium, but will do so by consulting with fans. Many supporters were angered when the stadium was renamed the Sports Direct Arena under former owner Mike Ashley. The club's new owners are seeking to increase revenues in an attempt to make the club more successful. New chief executive Darren Eales said the side was \"going to look at every opportunity we can\".But he told BBC Radio Newcastle it would be done \"in dialogue with our supporters\". He also called St James' Park \"the best place in the Premier League to come and watch football\". Asked if Newcastle were looking to rename the stadium, grow capacity or build a ground, Eales said: \"We will take our time and look at what's best for the club.\" Newcastle United chief executive Darren Eales answers fans' questionsNewcastle have spent more than £200m on players since the takeover a year ago, but Eales, who was appointed in July, said: \"At the current revenues, £200m isn't sustainable.\" He added: \"If we look at the stadium, we know the history of what happened with Sports Direct. \"Clearly that is something we want to talk to supporters about but there's a realisation, and we'll be open and communicate about this; we need to bring in revenues if we are going to put it on to the pitch. \"So we are going to look at every opportunity we can but do it in dialogue with our supporters. We are not going to do something that doesn't make good business sense because it upsets 99% of our supporters. That's really important, having that dialogue. \"We will look at all opportunities but one thing I would say is that St James' Park is the best place in the Premier League to come and watch football.\" Since the Saudi-led takeover a year ago, Newcastle have taken down the Sports Direct signs at St James' Park and have added a sleeve sponsor to their shirts. It is also understood that they will end their main shirt sponsor deal early, concluding the contract at the end of the current season. Eales, who was appointed in July and previously worked in the MLS (Major League Soccer) with Atlanta United, added: \"One of the important things I learned in the States was... we thought of everything from a fan experience because we had no fans. Every decision we made was through the lens of how does it affect the supporter experience? \"It was the right thing to do in terms of building a brand or business and what happens is that you find that the revenue follows.\" "},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Kristopher Knox","title":"World Series 2022: Latest Predictions and Buzz from MLB Twitter amid Playoff Race","description":"We're almost down to four teams in the Major League Baseball playoffs. The San Diego Padres and Philadelphia Phillies are set to kick off the National League s","url":"https://bleacherreport.com/articles/10052751-world-series-2022-latest-predictions-and-buzz-from-mlb-twitter-amid-playoff-race","urlToImage":"https://media.bleacherreport.com/image/upload/c_fill,g_faces,w_3800,h_2000,q_95/v1666095194/lnhyf9xnuzttbzeossne.jpg","publishedAt":"2022-10-18T14:00:00Z","content":"Astros SS Jeremy Peña (Daniel Shirey/MLB Photos via Getty Images)\r\nWe're almost down to four teams in the Major League Baseball playoffs. The San Diego Padres and Philadelphia Phillies are set to kic… [+5106 chars]","fullContent":"Astros SS Jeremy Peña (Daniel Shirey/MLB Photos via Getty Images)We're almost down to four teams in the Major League Baseball playoffs. The San Diego Padres and Philadelphia Phillies are set to kick off the National League Championship Series on Tuesday.The Houston Astros, meanwhile, completed a sweep of the Seattle Mariners over the weekend to claim a spot in the ALCS.The American League divisional series was supposed to wrap on Monday night. However, a rain delay turned into a postponement, so Game 5 between the Cleveland Guardians and New York Yankees will also take place on Tuesday.Jeff Passan @JeffPassanYankees and Guardians are rained out. Game 5 will be Tuesday at 4:07 p.m. ET. The ALCS starts Wednesday.Barring another weather delay, the ALCS should be set by Tuesday evening. Assuming that goes as planned, the upcoming schedule will be as follows:Lukas Weese @WeesesportsBelow is the League Championship Series broadcast schedule:<a href=\"https://twitter.com/hashtag/MLB?src=hash&amp;ref_src=twsrc%5Etfw\">#MLB</a> <a href=\"https://twitter.com/hashtag/Postseason?src=hash&amp;ref_src=twsrc%5Etfw\">#Postseason</a> <a href=\"https://t.co/8RFhJHn2fq\">pic.twitter.com/8RFhJHn2fq</a>The 2022 World Series is slated to kick off on Friday, October 28, with the team with the best record playing host. It is scheduled to conclude on Saturday, November 5, with all games being broadcast on Fox.So who will make and win the World Series? With five teams still alive, that's tough to predict. However, FiveThirtyEight has set probability percentages for all five teams using an Elo-based statistical system and simulations. The model is updated after every game.FiveThirtyEight Predictions to Reach, Win the World SeriesHouston Astros: 58 percent, 38 percentNew York Yankees: 31 percent, 20 percentSan Diego Padres: 52 percent, 19 percentPhiladelphia Phillies: 48 percent, 17 percentCleveland Guardians: 10 percent, 5 percentIt's interesting that the Yankees have better odds to win the World Series than two NL teams that have already made the conference championship round. However, it's not particularly surprising.New York features a talent-loaded roster—headlined by ace Gerrit Cole and slugger Aaron Judge—and won 99 games during the regular season. If the Yankees do get past Cleveland, they should have a legitimate shot at beating the 106-win Astros.Of course, not everyone expects New York to get past the overlooked Guardians.Will Burge @WillBurgeHilarious that Yankees fans have a team that won damn near 100 games, has a guy who set a home run “record”, and theyre at home in a Game 5 and they STILL are begging for a postponement to help them get past the big bad GuardiansCould Cleveland be the sleeper team that wins it all in 2022? FiveThirtyEight's model says it's unlikely. However, at least a few in the social-media world are hoping to see the Guardians make it to the final stage.Andrew Mason @MaseDenverI’m rooting for a Padres-Guardians World Series now.<br><br>Cleveland hasn’t won the World Series since 1948. San Diego has never won a major-sports title in anything, unless you count the Major Indoor Soccer League.<br><br>If I don’t have a team playing, I like seeing long droughts end.Of course, few expected the NLCS to feature the Padres and the Phillies, which goes to show just how difficult it can be to pick winners early in the season. The unexpected often happens in baseball, which is precisely why Cleveland could prevail.Anthony Castrovince @castrovinceThe Phillies and Padres are meeting in the NLCS, and next October we will still try to make predictions like dopes. I love baseball.Game 5 between New York and Cleveland could legitimately go either way. We could see both teams go deep into the bullpen, and Cleveland's depth could provide an edge there. But Judge and the Yankees' bats could also give New York an early lead.As for the National League series, the Padres seem to be the early favorites. Quinn Allen of SportsBettingDime has San Diego as the World Series representative thanks to the postseason experience of players like Yu Darvish, Joe Musgrove and Blake Snell.Bleacher Report's Joe Tansey also has the Padres going over the Phillies in the NLCS.\"San Diego's pitching depth, not the hitting of Juan Soto or Manny Machado, will ultimately give it the edge and send it back to the World Series for the first time since 1998,\" Tansey wrote.A panel of experts from MLB.com is split on the series, though San Diego again appears to be the favorite. In a poll of reporters and analysts, 46 picked the Padres, while 30 picked the Phillies.Padres third baseman Manny Machado led the picks for NLCS MVP with 18 votes.Most early predictions for the World Series champion have been rendered irrelevant because of teams like the Atlanta Braves and Los Angeles Dodgers bowing out before the championship round. However, Fox Sports' Ben Verlander's prediction of an Astros win is still alive.Verlander's prediction of the Astros over the Braves is not.The safest prediction that one can make, based on the postseason thus far, is that the unpredictable is likely to occur on the grandest stage. "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"World Cup's 101 Most Memorable Moments: North Korea upsets Italy","description":"North Korea knocked out Italy in No. 42 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-north-korea-upsets-italyworld-cups-101-most-memorable-moments-north-korea-upsets-italy","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/101-Most-Memorable-WC-Moments_42_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-10T05:02:57Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World … [+1744 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at World Cup 2022, No. 38: Kingsley Coman","description":"Kingsley Coman makes an already-frightening France side a threat on the wings, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-world-cup-2022-no-38-kingsley-coman","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.21.22_Top-50-World-Cup-Players_38_KINGSLEY-COMAN_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-14T03:57:22Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nKingsley Coman\r\nCountry: Fr… [+621 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at 2022 World Cup, No. 35: Rodri","description":"Rodri might not be the star of Spain's midfield, but he's vital to its success, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-2022-world-cup-no-35-rodri","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.21.22_Top-50-World-Cup-Players_35_RODRI_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-16T22:20:46Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nRodri\r\nCountry:SpainRank: 3… [+700 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at 2022 World Cup, No. 30: Ángel Di María","description":"At 34, Ángel Di María still has what Argentina needs in their attack, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-2022-world-cup-no-30-angel-di-maria","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.21.22_Top-50-World-Cup-Players_30_ANGEL-DI-MARIA_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-23T11:25:39Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nÁngel Di María\r\nCountry: Ar… [+496 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at World Cup 2022, No. 28: Rodrigo De Paul","description":"Argentina can count of Rodrigo De Paul to give it his all on the pitch, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-world-cup-2022-no-28-rodrigo-de-paul","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.21.22_Top-50-World-Cup-Players_28_RODRIGO-DE-PAUL_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-23T22:53:51Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nRodrigo De Paul\r\nCountry: A… [+547 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at World Cup 2022, No. 27: Marquinhos","description":"Marquinhos is known for his defense, but he can be the difference for Brazil on both sides of the ball, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-world-cup-2022-no-27-marquinhos","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.21.22_Top-50-World-Cup-Players_27_MARQUINHOS_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-24T22:19:55Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nMarquinhos\r\nCountry: Brazil… [+525 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"Top 50 players at World Cup 2022, No. 22: Romelu Lukaku","description":"Romelu Lukaku will be one of the most dangerous strikers at the World Cup, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-world-cup-2022-no-22-romelu-lukaku","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.22.22_Top-50-World-Cup-Players_22_ROMELU-LUKAKU_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-29T22:49:03Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players\r\n participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nRomelu Lukaku\r\nCountry: B… [+691 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Mallory Pugh and Sophia Smith: 'Bonafide superstars' and the future of USWNT","description":"The next generation of USWNT stars is already here. \"They're just taking everything to the next level,\" Megan Rapinoe says of Mallory Pugh and Sophia Smith.","url":"https://www.foxsports.com/stories/soccer/mallory-pugh-and-sophia-smith-bonafide-superstars-and-the-future-of-uswnt","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/10.16.22_Inside-the-Relationship-of-Mallory-Pugh-and-Sophia-Smith-USWNTs-Rising-Stars_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-17T15:52:28Z","content":"By Laken Litman\r\nFOX Sports Soccer Writer\r\nIn June, Vlatko Andonovski revealed the future of the U.S. women's national team.\r\n\"I don't think it will be surprising if I say that it will be extremely d… [+13821 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"MLS Decision Day: Philadelphia Union win East, playoff bracket is set","description":"Doug McIntyre recaps all of the action from MLS Decision Day.","url":"https://www.foxsports.com/stories/soccer/mls-decision-day-philadelphia-union-win-east-playoff-bracket-is-set","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/MLSDecisionDay.jpg?ve=1&tl=1","publishedAt":"2022-10-10T02:27:50Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nWith four MLS Cup playoff spots still up for grabs and seven teams still in the running for an invitation, Decision Day was primed for drama.\r\nSunday's fin… [+6332 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: Suárez bites Chiellini","description":"Luis Suárez got banned for nine international games because of No. 22 on our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-suarez-bites-chiellini","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.25.22_101-Most-Memorable-WC-Moments_22_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-29T22:24:35Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+1209 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"World Cup's 101 Most Memorable Moments: 'El Matador' shines for Argnetina","description":"Mario Kempes made himself a hero in Argentina for No. 24 on our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-el-matador-shines-for-argnetina","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.25.22_101-Most-Memorable-WC-Moments_24_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-28T11:13:37Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+1185 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: Ronaldo's 2002 redemption","description":"Brazil's Ronaldo got his redemption in No. 23 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-ronaldos-2002-redepmtion","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/08.25.22_101-Most-Memorable-WC-Moments_23_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-29T03:01:02Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+1125 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"USMNT World Cup roster prediction: Alexi Lalas picks his 26-man roster","description":"Alexi Lalas played the role of USMNT coach and picked his 26-man roster for the 2022 World Cup.","url":"https://www.foxsports.com/stories/soccer/usmnt-world-cup-roster-prediction-alexi-lalas-picks-his-26-man-roster","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/11.4.22_Alexi-Lalas-Picks-USMNT-Roster_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-04T21:28:58Z","content":"The United States men's national team will reveal its 26-man World Cup roster Wednesday. \r\nAhead of the highly-anticipated announcement, we asked FOX Sports soccer analyst and former USMNT defender A… [+1431 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: Gordon Banks robs Pelé","description":"England's Gordon Banks saved what looked like a sure goal from Brazil's Pelé.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-gordon-banks-robs-pele","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/09.13.22_101-Most-Memorable-WC-Moments_13_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-08T07:18:11Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+928 chars]","fullContent":"   Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continues with Gordon Banks' super save.It's often called the best save in soccer history. In England's group stage match against mighty Brazil at the 1970 World Cup, Gordon Banks, the gentlemanly Three Lions keeper, raced across this line and somehow kept out what looked like a certain goal from none other than Pelé himself.Unmarked at the far post, Pelé met Jairzinho's cross from the right side perfectly. \"I hit that header exactly as I had hoped. Exactly where I wanted it to go. And I was ready to celebrate,\" Pelé, who became close friends with Banks over the decades following their shared moment on the biggest stage, said following the Englishman's death in 2019.\"He came from nowhere, and he did something I didn't feel was possible,\" the Brazilian great added. \"He pushed my header, somehow, up and over. And I couldn't believe what I saw. \"Even now when I watch it, I can't believe how he moved so far, so fast.\"Gordon Banks robs Pele       \n    How did that not go in?\n      Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at 2022 World Cup, No. 41: Weston McKennie","description":"Weston McKennie is the engine that makes the USMNT go, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-2022-world-cup-weston-mckennie","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.16.22_Top-50-World-Cup-Players_41_WESTON-MCKENNIE_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-10T22:33:59Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nWeston McKennie\r\nCountry: U… [+759 chars]","fullContent":"   FOX Sports soccer analyst and former USMNT midfielder Stu Holden is counting down the 50 best players participating in the 2022 FIFA World Cup in Qatar. Up next is …Weston McKennieCountry: United StatesRank: 41Rank in 2018: N/APosition: MidfielderAge: 24Weston McKennie likes to have fun — it's partially why he missed two World Cup qualifiers last September. But when McKennie's on the pitch, he's all business.\"When I think of McKennie, I think of the engine vroom for the United States alongside Musah and Adams. But McKennie's the guy that can bring the X Factor; he can get into the box, he can score goals, but he's also going to bring a little bit of bite and a little of personality to this U.S. team.\"McKennie's a regular first team player with Serie A side Juventus, but his star has shined the brightest with the USMNT. If that continues at the World Cup, he'll get the opportunity to show more of his personality on and off the pitch.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at 2022 World Cup, No. 40: Memphis Depay","description":"Memphis Depay will be the focal point of the Netherlands' attack at the 2022 World Cup.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-2022-world-cup-no-40-memphis-depay","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.21.22_Top-50-World-Cup-Players_40_MEMPHIS-DEPAY_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-11T23:47:24Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nMemphis Depay\r\nCountry: Net… [+856 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at 2022 World Cup, No. 34: Dušan Vlahović","description":"At his best, Dušan Vlahović can guarantee Serbia make it out of a difficult group at the World Cup, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-2022-world-cup-no-34-dusan-vlahovic","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.21.22_Top-50-World-Cup-Players_34_DUSAN-VLAHOVIC_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-17T23:33:32Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nDuan Vlahovi\r\nCountry:Serbi… [+830 chars]","fullContent":"   FOX Sports soccer analyst and former USMNT midfielder Stu Holden is counting down the 50 best players participating in the 2022 FIFA World Cup in Qatar. Up next is …Dušan VlahovićCountry: SerbiaRank: 34Rank in 2018: N/APosition: StrikerAge: 22Since completing a £62.8 million move from Florentina to Juventus in January, Dušan Vlahović has struggled to find any sort of consistency with his goal-scoring. However, outside of Brazil's stacked squad, the 22-year-old is arguably the most feared player in Group G.\"This guy, in front of the box, is absolutely lethal with his finishing,\" Holden said of Vlahović. \"He can do it with his head, he can do it with his feet, and because of that, it's his positioning to get in those dangerous spots in front of the net [that makes him so good].\"Serbia have plenty of talent around Vlahović — particularly in the midfield — but if they're going to make it to the knockout stages for the first time ever as an independent nation, Vlahović is going to have to play like Serbia's star man.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at 2022 World Cup, No. 31: Bernardo Silva","description":"Bernardo Silva is the key to Portugal making a deep at the World Cup, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-2022-world-cup-no-31-bernardo-silva","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.22.22_Top-50-World-Cup-Players_31_BERNARDO-SILVA_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-21T08:29:11Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nBernardo Silva\r\nCountry: Po… [+873 chars]","fullContent":"   FOX Sports soccer analyst and former USMNT midfielder Stu Holden is counting down the 50 best players participating in the 2022 FIFA World Cup in Qatar. Up next is …Bernardo SilvaCountry: PortugalRank: 31Rank in 2018: N/APosition: MidfielderAge: 28Before the 2018 World Cup in Russia, Bernardo Silva was a star on the rise. His talent was undeniable, but with only a season of the Premier League under his belt — albeit a title-winning season — he wasn't considered on the same level as his Manchester City counterparts Kevin de Bruyne and David Silva.Now in his sixth season with City, Silva is one of the best midfielders in the world.\"If you’ve watched the Premier League over the past couple of years, you know this guy and you love him,\" Holden said of Silva. \"He’s silky smooth on the ball and a big part of Pep Guardiola’s Manchester City team.\"Cristiano Ronaldo might be the most accomplished and talented player on Portugal's squad, but on his day, Silva — who's almost 10 years younger than Ronaldo — is just as important as the six-time Ballon d'Or winner.Silva raises Portugal's ceiling       \n    Portugal's Bernardo Silva is known for his passing, positioning and technical ability.\n      Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at 2022 World Cup, No. 44: Darwin Nunez","description":"Uruguay's hopes of making it out of their group start with Darwin Núñez, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-2022-world-cup-darwin-nunez","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.16.22_Top-50-World-Cup-Players_44_DARWIN-NUNEZ_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-08T22:04:53Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nDarwin Núñez\r\nCountry: Urug… [+857 chars]","fullContent":"   FOX Sports soccer analyst and former USMNT midfielder Stu Holden is counting down the 50 best players participating in the 2022 FIFA World Cup in Qatar. Up next is …Darwin NúñezCountry: UruguayRank: 44Rank in 2018: N/APosition: AttackerAge: 23With Luis Suárez and Edinson Cavani nearing the end of their international careers, Uruguay needed a young striker to breakout before the World Cup. In Darwin Núñez, they got just that.\"He's a big, tall striker, but also has an incredible ability to finish the ball, which is what is most important for the No. 9 position,\" Holden said of Liverpool's £85 million man.The other attacking stars in Uruguay's group — Cristiano Ronaldo and Son Heung-min — have more experience on soccer's biggest stage, but if Núñez enters the tournament in good form, that might not matter.No. 44: Darwin Núñez       \n    Uruguay's Darwin Núñez is known for his finishing, physicality and technical ability.\n  More World Cup coverage:World Cup fan guide101 most memorable tournament momentsUniform tracker: Photos of every kit we've seen so far50 reasons to be excited for QatarWorld Cup odds: Lines for every team to win it all    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Top 50 players at World Cup 2022, No. 37: Christopher Nkunku","description":"Christopher Nkunku can go from rising star to superstar at the 2022 World Cup, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-world-cup-2022-christopher-nkunku","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.26.22_Top-50-World-Cup-Players_37_CHRISTOPHER-NKUNKU_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-15T03:49:01Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nChristopher Nkunku\r\nCountry… [+958 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"Top 50 players at World Cup 2022, No. 24: Bruno Fernando's","description":"Bruno Fernands will create goal-scoring opportunities for Portugal at the World Cup, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-world-cup-2022-no-24-bruno-fernandos","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.22.22_Top-50-World-Cup-Players_24_BRUNO-FERNANDES_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-28T11:39:54Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players\r\n participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nBruno Fernandes\r\nCountry:… [+829 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"Top 50 players at World Cup 2022, No. 23: Rúben Dias","description":"Portugal have a wall in the back with Rúben Dias, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-world-cup-2022-no-23-ruben-dias","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/09.22.22_Top-50-World-Cup-Players_23_RUBEN-DIAS_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-29T03:04:56Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players\r\n participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nRúben Dias\r\nCountry: Port… [+715 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Stu Holden","title":"Top 50 players at World Cup 2022, No. 20: Thomas Müller","description":"Thomas Müller will connect the dots in Germany's midfield, Stu Holden says.","url":"https://www.foxsports.com/stories/soccer/top-50-players-at-world-cup-2022","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/09.22.22_Top-50-World-Cup-Players_20_THOMAS-MULLER_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-01T22:48:20Z","content":"FOX Sports soccer analyst and former USMNT\r\n midfielder Stu Holden\r\n is counting down the 50 best players\r\n participating in the 2022 FIFA World Cup\r\n in Qatar. Up next is \r\nThomas Müller\r\nCountry: G… [+876 chars]","fullContent":"   FOX Sports soccer analyst and former USMNT midfielder Stu Holden is counting down the 50 best players participating in the 2022 FIFA World Cup in Qatar. Up next is …Thomas MüllerCountry: GermanyRank: 20Rank in 2018: 32Position: MidfielderAge: 33Few players in Qatar will have more impressive World Cup resumes than Thomas Müller. All-time, he's scored 10 goals at the tournament — the most of any active player — and in 2014, he won the Final with Germany.But his most recent showing at Russia 2018 was a disappointment, and if Germany are going to avoid getting knocked out in the group stage once again, the Bayern Munich star will have to bring a lot more to the table, especially with the lack of World Cup experience elsewhere on the roster.\"This is a guy that likes to play and has dubbed himself the ‘space invader’ because he finds that space between the lines,\" Holden said. \"He can connect from the midfield, he can arrive in the box and score goals late, and it’s no coincidence that when he didn’t score in Russia, Germany didn’t advance out of the group.\"    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"N'Golo Kanté expected to miss World Cup with hamstring injury","description":"France star defensive midfielder N'Golo Kanté is doubtful for the 2022 World Cup with a hamstring injury. Doug McIntyre explains what that means for Les Bleus.","url":"https://www.foxsports.com/stories/soccer/ngolo-kante-expected-to-miss-world-cup-with-hamstring-injury","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/kante.jpg?ve=1&tl=1","publishedAt":"2022-10-14T22:09:35Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nN'Golo Kanté is expected to miss the 2022 World Cup in Qatar because of the hamstring injury he originally suffered in the summer, according to multiple re… [+2795 chars]","fullContent":"   By Doug McIntyreFOX Sports Soccer WriterN'Golo Kanté is expected to miss the 2022 World Cup in Qatar because of the hamstring injury he originally suffered in the summer, according to multiple reports on Friday. The ball-winning defensive midfielder has not appeared since then for Les Bleus or his club, Chelsea of England's Premier League.Kanté, 31, has a history of hamstring issues. He's been sidelined since limping out of Chelsea's 2-2 tie with Tottenham on Aug. 14.Blues manager Graham Potter confirmed that Kanté had reinjured himself during his recovery but stopped short of giving a timetable for his return. However, outlets in both France and England said he won't be available until January at the earliest. The World Cup begins on Nov. 20.  \"It's a setback so it's not good news,\" Potter told reporters Friday during a press conference. \"Anything other than that at this stage, I can't give you anything more.\"A central figure for French coach Didier Deschamps four years ago as Les Bleus claimed their second World Cup title, Kanté started in all seven games, including the 4-2 victory over Croatia in the final. Just one of France's 23 players — central defender Raphaël Varane — logged more minutes at the 2018 event.Real Madrid's Aurélien Tchouaméni is probably the leading candidate to replace Kanté in Deschamps' first-choice French lineup. The 22-year-old is off to a terrific start to the La Liga season following his $80 million-plus summer transfer from Ligue 1 side Monaco.The absence of Kanté could be compounded by the loss of another midfield star from 2018, the attack-minded Paul Pogba. Pogba is racing to be healthy in time for Qatar after undergoing knee surgery last month. He was hurt while playing a preseason match for Italian club Juventus.Friday's news is just the latest calamity for France, which enters the World Cup having won just once in their last six outings. There have been distractions away from the field, too. Pogba was the victim of an extortion plot allegedly involving his brother, while star forward Kylian Mbappe boycotted a pre-World Cup photoshoot over a since resolved  image-rights dispute with the French Football Federation.Deschamps' squad begins the defense of their trophy on Nov. 21 against Australia. They'll meet Denmark — which beat France twice in UEFA Nations League play this year, including last month in their final game before traveling to Qatar — before closing out group play against Tunisia.History isn't on Les Bleus side. The other time France entered a World Cup as the titleholder, in 2002, they failed to score a single goal. They were also eliminated in the group stage in 2010, four years after reaching the final.One of the leading soccer journalists in North America, Doug McIntyre has covered United States men’s and women’s national teams at multiple FIFA World Cups. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"Carli Lloyd doesn't think USWNT will three-peat at 2023 World Cup","description":"Carli Lloyd explained why she doesn't think the USWNT will three-peat at the 2023 World Cup on \"Alexi Lalas' State of the Union Podcast.\"","url":"https://www.foxsports.com/stories/soccer/carli-lloyd-doesnt-think-uswnt-will-three-peat-at-2023-world-cup","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/wwc.jpg?ve=1&tl=1","publishedAt":"2022-10-27T17:34:20Z","content":"The United States women's national team has already cemented its legacy as a giant in Women's World Cup history. Since the quadrennial tournament's establishment in 1991, the USWNT has won it four ti… [+1599 chars]","fullContent":"   The United States women's national team have already cemented their legacy as a giant in Women's World Cup history. Since the quadrennial tournament's establishment in 1991, the USWNT have won it four times and never finished worse than third place.But next summer in Australia and New Zealand, Vlatko Andonovski's side will have the opportunity to do something no team in men's or women's soccer has ever done: three-peat as World Cup champions. Can they actually do it? Carli Lloyd isn't so sure.On Thursday's episode of \"Alexi Lalas' State of the Union Podcast,\" Lloyd, a two-time World Cup-winner with the USWNT and a three-time FIFA Player of the Year-winner, explained why she's not ready to say her former squad will win the 2023 World Cup.Carli Lloyd DOES NOT believe USWNT will three-peat       \n    Alexi Lalas and David Mosse listen to Carli Lloyd explaining why she doesn't believe USWNT will win the 2023 FIFA Women's World Cup.\n  \"You know, being a player, you always like when people are knocking you down and not supporting,\" Lloyd told Lalas and co-host David Mosse. \"Right in this particular moment, I’m probably going to have to say no.\"But there’s time. They have a lot to prove and that’s the beauty of it. I think they still have a lot more time to grow and become even better. So I’m excited to see that and excited to see what’s to come for them.\"This is far from the first time the USWNT have had their doubters. In fact, Lalas reminded Lloyd that before the U.S. repeated as champion in 2019, he told Lloyd that he didn't think they'd pull it off.The difference is that the USWNT aren't considered the overwhelming favorite to win the tournament this year. Though they're FIFA's No. 1 team and FOX Bet's favorite to win it all, there's reason to believe England, a team that beat the U.S. in October, are ready to challenge the defending champs.We'll see if Lloyd is right about the young Yanks. If she's wrong, it's safe to assume she won't be too broken up about it.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: Bergkamp settles it vs. Argentina","description":"Dennis Bergkamp scored a sensational match-winner in moment No. 19 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-bergkamp-settles-it-vs-argentina","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/09.13.22_101-Most-Memorable-WC-Moments_19_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-02T04:58:41Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+1454 chars]","fullContent":"   Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continues with Dennis Bergkamp's sensational match-winner.It took Dennis Bergkamp just three touches to score one of the greatest World Cup goals of all time. The score tied at one, the Netherlands’ quarterfinal meeting with Argentina at France ‘98 seemed destined for extra time before the silky smooth Dutch forward intervened.Netherlands left back Frank de Boer started the play with a long, diagonal crossfield pass to Bergkamp. It arrived high enough that many superb players would have had trouble controlling it. But Bergkamp was known for his immaculate touch, and he killed the ball dead with an outstretched right foot.There was still plenty to do, though, what with Albiceleste defender Roberto Ayala closing in quickly. Bergkamp’s second touch might have been sweeter than his first; he undressed Ayala with a left-footed stab that he knew would set up his shot. He wasn’t about to squander it, beating Carlos Roa with the outside of his right foot to send Argentina home and exact some revenge in the process; it was the first World Cup meeting between the countries since the Albiceleste beat the Oranje in the final 20 years earlier. And it was almost all thanks to Bergkamp. Bergkamp's legendary goal       \n    Dennis Bergkamp was cool, calm and collected in front of goal with the World Cup on the line.\n  Doug McIntyre is a soccer writer for FOX Sports. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports and he has covered United States men’s and women’s national teams at multiple FIFA World Cups. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: U.S. pull off massive upset vs. England","description":"The U.S. stunned England in moment No. 17 of our 101 most memorable World Cup moments countdown.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-u-s-pull-off-massive-upset-vs-england","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/09.13.22_101-Most-Memorable-WC-Moments_17_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-04T05:36:26Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+1406 chars]","fullContent":"   Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continues with United States' unthinkable win vs. England at the 1950 World Cup.To say that the United States was a heavy underdog going into its World Cup meeting with England at the 1950 World Cup doesn’t do justice to the mismatch it was. England, competing in the tournament for the first time, was arguably the best team in Brazil and one of the favorites to lift the trophy after trouncing defending champion Italy 4-0 weeks before the competition began.The members of the U.S. squad, on the other hand, weren’t even full-time professionals. The Americans arrived in Brazil having played just seven international games over the previous 16 years (in part because of World War II), getting outscored 45-2. The Yanks were going to lose. The only question was by how much.Except they didn’t. In one of the biggest upsets in World Cup history, the U.S. stunned the Three Lions 1-0 in Belo Horizonte on Joe Gaetjens’s first half goal. England was eliminated after also dropping its next match, to Spain. Same for the U.S., who were knocked out following a 5-2 defeat to Chile. The Americans wouldn’t qualify for another World Cup for 40 years.The Game Of Their Lives       \n    The semi-pro U.S. men's national team stunned the English giants.\n  Doug McIntyre is a soccer writer for FOX Sports. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports and he has covered United States men’s and women’s national teams at multiple FIFA World Cups. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: Andres Escobar's tragedy","description":"Andres Escobar was shot and killed in Colombia for his own goal at the World Cup.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-andres-escobars-tragedy","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/09.13.22_101-Most-Memorable-WC-Moments_15_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-07T00:35:11Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+1595 chars]","fullContent":"   Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continues with Andres Escobar's fatal shooting.Perhaps the darkest, most shameful moment in World Cup history came thousands of miles off the field, 10 days after Colombia captain Andrés Escobar's own goal in a group stage loss to the host United States in 1994.Los Cafeteros were considered a dark horse to win the title that year. With a stacked team anchored by central defender Escobar, expectations were sky-high back home. But after an opening match loss to Romania, the Colombian team received what they regarded as credible death threats — the South American country was in mired in a violent drug war at the time — at the team hotel. Their nerves frayed, Colombia played tight against the home team. Seven minutes before halftime, the worst case scenario happened: trying to block a cross, Escobar inadvertently deflected the ball into his own net. The U.S. scored another after the break and held on to win 2-1, eliminating Colombia from knockout state contention before their final group match.Back home in the city Medellín less than two weeks later, Escobar was confronted in a parking lot by a gang of criminals who had reportedly lost huge sums of money betting on Colombia's games. They taunted him for the own goal before gunning him down in cold blood in retaliation for the mistake. Escobar was just 27 years old.The tragedy of Andres Escobar       \n    Andres Escobar was shot and killed in Colombia for his mistake at the World Cup.\n  Doug McIntyre is a soccer writer for FOX Sports. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports and he has covered United States men’s and women’s national teams at multiple FIFA World Cups. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"Carli Lloyd has doubts about USWNT's chances to three-peat at 2023 World Cup","description":"Carli Lloyd explained why she thinks the USWNT has a lot of work to do in its bid to three-peat in 2023 on \"Alexi Lalas' State of the Union Podcast.\"","url":"https://www.foxsports.com/stories/soccer/carli-lloyd-has-doubts-about-uswnts-chances-to-three-peat-at-2023-world-cup","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/wwc.jpg?ve=1&tl=1","publishedAt":"2022-10-27T18:06:55Z","content":"The United States women's national team has already cemented its legacy as a giant in Women's World Cup history. Since the quadrennial tournament's establishment in 1991, the USWNT has won it four ti… [+1599 chars]","fullContent":"   The United States women's national team have already cemented their legacy as a giant in Women's World Cup history. Since the quadrennial tournament's establishment in 1991, the USWNT have won it four times and never finished worse than third place.But next summer in Australia and New Zealand, Vlatko Andonovski's side will have the opportunity to do something no team in men's or women's soccer has ever done: three-peat as World Cup champions. Can they actually do it? Carli Lloyd isn't so sure.On Thursday's episode of \"Alexi Lalas' State of the Union Podcast,\" Lloyd, a two-time World Cup-winner with the USWNT and a three-time FIFA Player of the Year-winner, explained why she's not ready to say her former squad will win the 2023 World Cup.Carli Lloyd DOES NOT believe USWNT will three-peat       \n    Alexi Lalas and David Mosse listen to Carli Lloyd explaining why she doesn't believe USWNT will win the 2023 FIFA Women's World Cup.\n  \"You know, being a player, you always like when people are knocking you down and not supporting,\" Lloyd told Lalas and co-host David Mosse. \"Right in this particular moment, I’m probably going to have to say no.\"But there’s time. They have a lot to prove and that’s the beauty of it. I think they still have a lot more time to grow and become even better. So I’m excited to see that and excited to see what’s to come for them.\"This is far from the first time the USWNT have had their doubters. In fact, Lalas reminded Lloyd that before the U.S. repeated as champion in 2019, he told Lloyd that he didn't think they'd pull it off.The difference is that the USWNT aren't considered the overwhelming favorite to win the tournament this year. Though they're FIFA's No. 1 team and FOX Bet's favorite to win it all, there's reason to believe England, a team that beat the U.S. in October, are ready to challenge the defending champs.We'll see if Lloyd is right about the young Yanks. If she's wrong, it's safe to assume she won't be too broken up about it.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: The birth of total football","description":"Johan Cruyff and the Netherlands brought Total Football to the masses at the 1974 World Cup.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-the-birth-of-total-football","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/09.13.22_101-Most-Memorable-WC-Moments_16_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-06T16:54:42Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+1404 chars]","fullContent":"   Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continues with the birth of Total Football.Contrary to popular belief, the Netherlands didn't invent the concept of Total Football, the fluid tactical scheme in which any player can replace any other regardless of position if the situation calls for it within a game. The Dutch do deserve the credit for bringing the idea to the masses at the 1974 World Cup, though. Oranje manager Rinus Michels was longtime proponent of the system. And he found the perfect disciple in star forward Johan Cruyff, a technical and tactical savant (he entered the tournament having won three straight Ballon d'Ors) whom Michels allowed to roam all over the field in search of the areas in which he could be the most dangerous.Total Football took the Netherlands to their first World Cup final, with resounding wins over Argentina and holders Brazil along the way. Cruyff's dazzling run following a 15-pass sequence from the opening kickoff helped give the Dutch the early lead over West Germany in the decisive contest. As it turned out, Total Football wasn't foolproof; Cruyff was man-marked out the game, and the Germans won the World Cup on home soil.Total Football for The Oranje       \n    The Netherlands brought Total Football to the masses at the 1974 World Cup.\n  Doug McIntyre is a soccer writer for FOX Sports. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports and he has covered United States men’s and women’s national teams at multiple FIFA World Cups. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"USMNT Stock Watch: Ricardo Pepi, Gio Reyna get hype trains back on track","description":"Pepi and Reyna are making their World Cup bids at the perfect time. Doug McIntyre takes a look at the rest of the USMNT player pool.","url":"https://www.foxsports.com/stories/soccer/usmnt-stock-watch-ricardo-pepi-gio-reyna-get-hype-trains-back-on-track","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/10.25.22_Whos-on-the-plane-USMNT_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-25T23:44:40Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's Note: \"Plane to Qatar\" is FOX Sports' weekly feature tracking the progress of players hoping to crack the United States\r\n Men's National Team's 26… [+8008 chars]","fullContent":"   By Doug McIntyreFOX Sports Soccer WriterEditor's Note: \"Plane to Qatar\" is FOX Sports' weekly feature tracking the progress of players hoping to crack the United States Men's National Team's 26-player roster for the 2022 FIFA World Cup in Qatar.Tuesday was a mixed bag for some of the USMNT's most important players. Christian Pulisic made just his fourth start of the season for Chelsea and took advantage of the opportunity, setting up Kai Havertz's game-winning goal in the second half of a 2-1 win in Salzburg — a victory that sent the Blues into the knockout stage of the UEFA Champions League with one group game to spare.Elsewhere in the Champions League, Giovanni Reyna went 87 minutes in Borussia Dortmund's scoreless draw at mighty Manchester City on Tuesday. That marks the longest shift of the season so for Reyna, who has been beset by injuries.It was also the first time that the 19-year-old attacker, who scored his first goal in more than a year over the weekend, has started consecutive games for club or country since August of 2021. Meantime, Weston McKennie scored for the second time in as many games in Juventus 4-3 loss at Benfica.It wasn't all good news. A muscle injury kept Sergiño Dest out of AC Milan's 4-0 win over Dinamo Zagreb. Cameron-Carter Vickers was extremely lucky not to be punished for a missed tackle in Tuesday's 1-1 tie with Shakhtar Donetsk. And in England's second tier, Josh Sargent didn't score for the third game in a row.With U.S. coach Gregg Berhalter set to name his squad two weeks from Wednesday, here's where 37 World Cup hopefuls stand.First classF/M Brenden Aaronson (Leeds): Aaronson was one of the few bright spots for freefalling Leeds in Sunday's 3-2 loss vs. Fulham.*M Tyler Adams (Leeds): Adams missed the match with an injury. \"We're hoping it won't be longer than a few days,\" Leeds manager Jesse Marsch said on Tuesday. He's not alone.*D Sergiño Dest (AC Milan): Dest was having his best performance this season before the injury forced him off at halftime of Saturday's 4-1 win versus Monza. He wasn't healthy enough to dress on Tuesday.^F Ricardo Pepi (Groningen): Pepi's fifth goal in six Eredivisie games since arriving on loan from Germany's Augsburg helped Groningen upset PSV Eindhoven on Sunday.M Weston McKennie (Juventus): McKennie scored his first Serie A goal of the season against Empoli last week and followed it up with his second in the Champions League Tuesday:M Yunus Musah (Valencia): Saturday's 2-1 loss to Mallorca marked the fifth time the teenager has played all 90 minutes this season, and the first since Sept. 10.F Christian Pulisic (Chelsea): The hope is the USMNT headliner can string together a few starts between now and the World Cup.F/M Giovanni Reyna (Borussia Dortmund): Reyna is rounding into form at the right time. His goal over the weekend was a gem:D Antonee Robinson (Fulham): Jedi went the distance at left back in both of the Fulham's two wins last week, helping the club climb to seventh place in the Premier League.^G Zack Steffen (Middlesbrough): Steffen has been quietly excellent for Boro lately. He made four good saves in Saturday's scoreless draw with Huddersfield, and he's making a case to reclaim the No. 1 U.S. keeper job he held through most of World Cup qualifying.^G Matt Turner (Arsenal): Turner posted his third consecutive clean sheet the Gunners UEFA Europa League win over PSV last week in. The rematch is Thursday in Eindhoven.F Tim Weah (Lille): The winger has come off the bench in three consecutive Ligue 1 games since returning from an ankle injury.D Walker Zimmerman (Nashville): Center back Zimmerman is one of nine World roster hopefuls participating in \"fitness workouts\" with national team coaches in Frisco, Texas through Nov. 5, U.S. Soccer confirmed on Tuesday.Comfort PlusM Kellyn Acosta (LAFC): The gritty dead-ball specialist set up the goal that sent LAFC into Sunday's Western Conference final against Austin.M Paul Arriola (Dallas): Arriola played all 90 minutes Sunday in FCD's season-ending loss to Austin. He and club teammate Jesús Ferreira will stick around Toyota Stadium for the next 10 days in an effort to maintain their fitness.D Cameron Carter-Vickers (Celtic): Carter-Vickers conceded a penalty in Celtic's 4-3 weekend win at Hearts and was bailed out of another mistake on Tuesday:D Reggie Cannon (Boavista): Injured in the Americans' 2-0 loss to Japan last month, Cannon on Sunday made his first start for Boavista since Sept. 17, going the distance in a 3-2 loss to Guimarães.M Luca de la Torre (Celta Vigo): An unused substitute in the previous three La Liga games, De La Torre came off the bench for the final 12 minutes of Monday's 1-1 draw with Getafe.  He's appeared in just five of Celta's 11 matches this season, logging a total of 50 minutes.⌄F Jesús Ferreira (Dallas): For months, Ferreira seemed like the U.S. striker most likely to start in Qatar. That's no longer the case after his season ended with a seven-game goalless drought.G Sean Johnson (New York City): Johnson made two top-drawer saves Sunday in the Pigeons' 3-1 playoff win in Montreal. NYCFC plays at Philadelphia next Sunday for an MLS Cup trip (8 p.m. ET FS1/FOX Deportes/FOX Sports app)D Aaron Long (New York Red Bulls): Participating in fitness workouts through Nov. 5.With Carter-Vickers, Mark McKenzie, Erik Palmer-Brown and Tim Ream all playing regularly right up until the World Cup, Long – who didn't have a great MLS season after missing most of 2021 following Achilles surgery – could be in trouble.D Mark McKenzie (Genk): The center back has played every minute of the Belgian leaders last 11 games. Genk is 10W-0L-1T over that span with just seven goals allowed.M Jordan Morris (Seattle Sounders): Participating in fitness workouts through Nov. 5.F Josh Sargent (Norwich City): The striker went the full 90 in Tuesday's 1-0 loss to Championship leaders Burnley.D Joe Scally (Borussia Monchengladbach): Has started every game for ‘Gladbach this season, including Bundesliga and German Cup losses last week. D DeAndre Yedlin (Miami): Participating in fitness workouts through Nov. 5.Standby listM Johnny Cardoso (Internacional): If Adams' injury is more serious than believed — heaven forbid — it would open up a spot for the Brazil-based Cardoso.G Ethan Horvath (Luton Town): Horvath allowed four goals for the first time this season in Sunday's loss in Watford. His gaffe gifted the hosts one of them:M Djordje Mihailovic (Montreal): Though he scored (on Johnson) on Sunday, the playmaker's already slim roster chances were further diminished by Montreal's season-ending loss to NYCFC.D Erik Palmer-Brown (Troyes): The center back returned to the French club's lineup Sunday following a one-match absence.F Jordan Pefok (Union Berlin): The French-born striker is scoreless in four games for the Bundesliga leaders following Sunday's loss to Bochum.*D Chris Richards (Crystal Palace): A projected starter when healthy, Richards has played just 135 minutes of first team soccer since April and still hasn't returned to training with Palace. It's hard to see a scenario in which the unquestionably talented center back will be fit enough for World Cup games four weeks from now.D Tim Ream (Fulham): At 35, Ream's career season continues. He's played in every Prem game this season for the Cottagers.M Cristian Roldan (Seattle Sounders): Participating in fitness workouts through Nov. 5.M Malik Tillman (Rangers): Tillman went the distance in Saturday's 1-1 draw with Livingston. Rangers travel to Napoli Wednesday for their penultimate Champions League group stage match.D Sam Vines (Royal Antwerp): The left back went 90 in Sunday's 3-1 loss to McKenzie's Genk.F Haji Wright (Antalyaspor): Held scoreless in Friday's 2-1 win over Istanbulspor.*Injured^Bumped up⌄Bumped downAdded: NoneDropped: NoneDoug McIntyre is a soccer writer for FOX Sports. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports and he has covered United States men’s and women’s national teams at multiple FIFA World Cups. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Laken Litman","title":"Alex Morgan, Adrianna Franch return to USWNT roster for Germany friendlies","description":"Alex Morgan and Mallory Pugh are back with the USWNT, but Adrianna Franch might be the most notable return. Laken Litman breaks down the latest roster.","url":"https://www.foxsports.com/stories/soccer/alex-morgan-adrianna-franch-return-to-uswnt-roster-for-germany-friendlies","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/franch.jpg?ve=1&tl=1","publishedAt":"2022-10-31T21:44:49Z","content":"Goalkeeper Adrianna Franch is back on the U.S. women's national team roster, which serves as a reminder that even if a player doesn't get called into a training camp for months, she can still make he… [+6317 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Women's World Cup Draw: USWNT-Netherlands headlines 10 must-see matches","description":"The USWNT and the Netherlands will go head-to-head in a rematch of the 2019 World Cup Final. Doug McIntyre breaks down the must-see games.","url":"https://www.foxsports.com/stories/soccer/womens-world-cup-draw-10-must-see-games","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/10.21.22_Womens-World-Cup-2023-Games-to-Watch_16x0.jpg?ve=1&tl=1","publishedAt":"2022-10-22T11:29:29Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nThe mens World Cup is just around the corner, and the womens event isnt far behind. It certainly feels closer now, after the draw for the 2023 FIFA Womens … [+6801 chars]","fullContent":"   By Doug McIntyreFOX Sports Soccer WriterThe men’s World Cup is just around the corner, and the women’s event isn’t far behind. It certainly feels closer now, after the draw for the 2023 FIFA Women’s World Cup was held on Saturday in Auckland, New Zealand.Here are the 10 must-watch group stage matches at Australia/New Zealand 2023, which kicks off next July with a record 32 teams.USA-NetherlandsThe second group game for both nations is a rematch of the 2019 Women’s World Cup final in France, which the U.S. won 2-0 on goals by Megan Rapinoe and Rose Lavelle. Much has changed for the two teams in the almost four years since.The Americans have a revamped roster; Rapinoe, the joint-top scorer and Golden Ball winner at France 2019, won’t be likely to start at age 38. Meantime, the Dutch have been overtaken by rising European counterparts England and Spain, dropping from third to eighth in the FIFA ranking and stumbling at the Euros last summer after winning the continental title in 2017. New Zealand-Norway The opening match of any World Cup is special. It certainly will be for the co-hosts, who meet former world, Olympic and European champion Norway in the July 20 curtain-raiser.It’s the sixth time the Football Ferns are appearing at the main event; they’ll be hoping that competing on home soil will help them to advance to the knockout stage for the first time. Beating the Norwegians would help. That’s a realistic goal against a side that’s regressed heavily over the last two decades; even with former Ballon d’Or winner Ada Hegerberg back in the fold, England beat Norway 8-0 at Euro 2022, the largest defeat in program history.Australia-CanadaA day after New Zealand play their first match, the other co-host kicks off their World Cup campaign against 2020 Olympic gold medalists Canada.Led by all-planet striker Sam Kerr, the 11th-ranked Matildas are looking to make their deepest run ever — assuming of course that they survive the \"Group of Death.\" Australia reached the quarterfinals at three consecutive World Cups before bowing out in the round of 16 in 2019.As for Canada, Les Rouges are hoping to finally replicate their Olympic success (the Canadians won bronze in 2012 and ’16) on the game’s biggest stage, where they’ve never advanced beyond the quarterfinals.England-ChinaBig things are expected from the Lionesses after they won the European title last summer, just the second major tournament title for England, men’s or women’s, and the first in more than half a century.  Sarina Wiegman’s side opens against a to-be-determined opponent (either Chile, Haiti or Senegal) and faces a good Danish team in their second match. But the marquee game is the Group D finale against the 15th-ranked Chinese, who have advanced to the knockout stage in each of the six Women’s World Cups they’ve participated in.Spain-JapanTwo of the most technically gifted teams in the competition will meet in this delicious Group B encounter. Spain, which upset the top-ranked U.S. earlier this month, boasts a golden generation of talent led by Alexia Putellas, the world’s consensus-best player and Ballon d’Or winner in 2021 and ’22. La Roja is a contender to win it all despite a disappointing quarterfinal exit at the Euros, where they lost in extra time to eventual champ England.This game against No. 11 Japan, the 2011 World Cup winner and 2015 runner-up, will tell us plenty about where Spain stands. France-Brazil Heavyweights in the men’s game, Brazil and France have evolved into elite teams on the women’s side over the last quarter-century despite somehow still having no World Cup or Olympic titles between them. That could change next summer. The fifth-ranked Les Bleus still have a chip on their shoulder and a point to prove following that narrow quarterfinal loss to the United States in Paris in 2019, a defeat that also prevented them from qualifying for last years’ Tokyo Olympics. Brazil has to like its chances after winning its first Copa América Femenina crown earlier this year. Oh, and both teams play beautiful soccer, too.USA-VietnamThe Americans’ title defense begins when they meet the Vietnamese in Auckland on Day 3. Much will be made of the political history between the two countries in the lead up to the match, but the U.S. will be heavy favorites on the field against a country competing at its first World Cup, men’s or women’s. The last time the U.S. opened a World Cup against an opponent from the Asian Football Confederation, in 2019, they ran out 13-0 winners. That lopsided victory over Thailand sent them on their way to a fourth title. Looking to become the first team, men’s or women’s, to win three straight World Cups, Vlatko Andonovski’s squad will be hoping history repeats itself next summer.Denmark-EnglandWith all due respect to Chile, Haiti and Senegal, England won’t get their first true test at Australia/New Zealand 2023 until they meet the Danes in Brisbane on July 22 in their second group stage game.Eighteenth-ranked Denmark was one of the world’s best teams in the 1990s, and they’re on the way back up now after missing the last three World Cups. And while the Danish will still be significant underdog against the reigning European titlists, they do have a reputation as giant-killers. At the Euros in 2017, Denmark ended Germany’s 22-year run as continental champions. They also went a perfect 8-0 in qualifying matches for this World Cup, scoring 40 goals while conceding just two. They won’t roll over for the Lionesses. USA-Cameroon/Thailand/PortugalFor any country with ambitions to win the World Cup, surviving the first round is Step 1. For the U.S., not suffering a letdown in their group stage finale in 2023 will be equally important.The Americans should beat whoever they end up facing on Matchday 3. But coming on the heels of that marquee contest against the Netherlands, the U.S. could easily end up in a psychological battle with themselves. That might not matter on the day. But it definitely could when the knockout phase begins. So keep a keen eye on how locked in and sharp Andonovski’s team is in this one. It could tell us plenty about how the USWNT might fare when it matters most.  Germany-MoroccoMaking their first appearance at a Women’s World Cup, Morocco will also become the first Arab nation to play in the event when they take on two-time champion Germany in their opening match.The No. 3-ranked Germans have their sights set on their first global title since winning Olympic gold in 2016. They were eliminated in the quarterfinals of the last World Cup — like France, missing the Tokyo Games because of it — after finishing fourth at Canada 2015. It could be a long day for the newcomers.One of the leading soccer journalists in North America, Doug McIntyre has covered United States men’s and women’s national teams at multiple FIFA World Cups. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"MLS Cup 2022: LAFC, Philadelphia Union set stage for Final","description":"Los Angeles Football Club and the Philadelphia Union will play in the MLS Cup Final. Doug McIntyre recaps how they got there.","url":"https://www.foxsports.com/stories/soccer/mls-cup-2022-lafc-philadelphia-union-set-stage-for-final","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/mlscup.jpg?ve=1&tl=1","publishedAt":"2022-10-31T03:50:38Z","content":"Major League Soccer's 27th final is set after LAFC and the Philadelphia Union advanced to the 2022 MLS Cup (Saturday, 4 p.m. ET, FOX) by beating Austin FC and New York City FC, respectively, in Sunda… [+5221 chars]","fullContent":"   Major League Soccer's 27th final is set after LAFC and the Philadelphia Union advanced to the 2022 MLS Cup (Saturday, 4 p.m. ET, FOX) by beating Austin FC and New York City FC, respectively, in Sunday's conference finals.Here are three quick thoughts on Sunday's two games and the much anticipated title match, which will pit the two best regular season teams against each other at Banc of California Stadium in Los Angles.Philadelphia gets revenge, setting up dream MLS CupWhen Maxi Moralez scored to give NYCFC a second half lead in Chester, Pennsylvania, it looked like the Pigeons might spoil Philly's party for the second year running.Instead, it lit a fire under a Union squad that had been waiting all year to face the team that eliminated them at the same stage last year under extraordinary circumstances.Determined not to suffer a similar fate this year, Jim Curtin's team turned the game on its head with goals by Julián Carranza and Dániel Gazdag almost exactly two minutes apart. The punch-drunk visitors held on for another nine minutes, but it was already all but over when substitute Cory Burke sealed the win with about a quarter-hour to go:  Philly's stirring comeback sends the club to its first MLS Cup 12 years after arriving in the league — and maybe 11 months longer than it should've taken. It's no less than they deserve, though, as Curtin, the 2022 MLS coach of the year, has cultivated a winning environment without the resources of some of the league's deeper pocketed competitors, including LAFC. The Union will be underdogs next week, not that they'll care. They come to play. If the 2022 MLS Cup is anywhere near as entertaining as the last few meetings between these teams, neutral fans could be in for a memorable finale.It's LAFC's MLS Cup to loseIt's become so rare for a Supporters Shield winner advance to MLS Cup — before LAFC accomplished the feat Sunday, just one had made it since 2011 — that the regular season title has become seen almost as a curse.Doubts about Steve Cherundolo's team were based on cold hard reality, too. After dominating the league during the first half of the season, they weren't good down the stretch — an ominous sign. During the lightning-quick MLS postseason, momentum is usually everything.LAFC didn't have much, but they showed enough resilience in a thrilling playoff El Tráfico to outlast the rival LA Galaxy despite an unconvincing performance. Yet when it mattered on Sunday against a legit Austin FC side that beat them in both meetings earlier in the year, Carlos Vela & Co. produced one of their most mature, professional showings of 2022.LAFC has been a model club since joining MLS as an expansion team four years ago. They hoisted their first Supporters Shield in 2019. The next year they nearly won the CONCACAF Champions League, losing on a late goal to Mexico's Tigres. The wheels finally fell off last season, as LAFC failed to make the playoffs for the first time and original coach Bob Bradley left for Toronto FC.Not even Cherundolo expected his maiden campaign to go this well. But LAFC led the league almost all year, then bolstered their squad (and made a global splash in the process) in the summer by adding decorated European veterans Gareth Bale and Giorgio Chiellini. The lesser known likes of forwards Denis Bouanga and Cristian Arango have gotten them here, though, with unsung MLS lifers like Kellyn Acosta, Max Crepeau and Ryan Hollingshead underpinning the turnaround in their first season in Los Angeles. (Bale was an unused substitute on Sunday, while Chiellini was pulled at halftime for tactical reasons.)They're now just 90 minutes away from the trophy they covet most. They're playing at home. Things couldn't set up any better for LAFC. On Saturday at the Banc, it's their MLS Cup to lose.Austin, NYCFC will be backAustin FC got a harsh a lesson on Sunday, outclassed as they were over 90 minutes in the 3-1 loss in Los Angeles. That still doesn't take away from what the Texas club was able to do this year in just its second season in MLS.If LAFC is MLS's standard-bearer, the Verde aren't far behind. Coach Josh Wolff and Sporting Director Claudio Reyna have assembled a balanced and deep squad populated by proven league vets and talented imports, not least MVP finalist Sebastián Driussi. The front office is first class, and their fans are already some of the best in MLS. Austin's run to within a game of the title match was no accident. They finished second in the Western Conference and gained valuable postseason experience this fall. Already a bona fide Cup contender, they should stay one for years to come.Same goes for the Pigeons back East. Even with decisions looming on interim coach Nick Cushing and star midfielder Moralez, who turns 36 in February, there is a foundation of success to build on. Their nomadic existence continues to be a black eye for the league, with no permanent home stadium anywhere on the horizon. But from a pure soccer perspective, there's no reason to think that young, resilient NYCFC won't be right back in the mix for another title run next year.One of the leading soccer journalists in North America, Doug McIntyre has covered United States men’s and women’s national teams at multiple FIFA World Cups. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports. Follow him on Twitter @ByDougMcIntyre.    Get more from MLS Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: Germany upsets Hungary","description":"Before Germany were four-time World Cup champions, they were the underdogs against Hungary. This is memorable moment No. 18.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-hungary","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/09.13.22_101-Most-Memorable-WC-Moments_18_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-02T22:56:45Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+1912 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"Which Cristiano Ronaldo will show up for Portugal at World Cup 2022?","description":"In the midst of a forgettable season with Man U, Cristiano Ronaldo will try to rise to the occasion at the World Cup.","url":"https://www.foxsports.com/stories/soccer/which-cristiano-ronaldo-will-show-up-for-portugal-at-world-cup-2022","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/cristiano1.jpg?ve=1&tl=1","publishedAt":"2022-11-04T18:56:56Z","content":"Even the biggest Cristiano Ronaldo fan will agree that Ronaldo's otherworldly career has at times been overshadowed by the accomplishments of this era's other resident superstar, Lionel Messi, widely… [+4438 chars]","fullContent":"   Even the biggest Cristiano Ronaldo fan will agree that Ronaldo's otherworldly career has at times been overshadowed by the accomplishments of this era's other resident superstar, Lionel Messi, widely considered the best player in soccer history.Ronaldo is one of the game's greatest in his own right, so naturally he's always been compared to Messi despite having more club goals, being the all-time top scorer in both the UEFA Champions League and at the men's national team level, and winning five European club crowns to Messi's four. Not always favorably, either. Now Ronaldo is now 37. Like his longtime rival, he'll take his final turn on the global stage when the 2022 FIFA World Cup in Qatar kicks off later this month. And frankly, his prospects for individual success there don't seem great.While the 35-year-old Messi has finally found his feet in his second year with Paris Saint-Germain, Ronaldo has been a sideshow for Manchester United this season. He tried to force his way out of the club in the final weeks of the summer transfer window. He's started just four of the 11 Premier League matches he's appeared in. He refused to be subbed into a game against Tottenham last month, left Old Trafford before the contest ended, and was subsequently suspended by United's no-nonsense new manager Erik ten Hag.Ten Hag and Ronaldo seem to have patched things up since then, but it would surprise nobody if the Portuguese forward leaves town for good when the winter window opens in January — if he can find a taker.Because the fact is that Ronaldo hasn't performed well this season. He's got just one goal in the Prem. His other two, in the Europa League, both came against Moldovan minnow FC Sheriff, though he did set up Alejandro Garnacho's winner over Spain's Real Sociedad on Thursday.Given his age and his inability to play the sort of high-pressure game most leading clubs now prefer, one has to wonder if Ronaldo can ever be a dominant force again. We'll find out soon, when Ronaldo pulls on his nation's colors in Qatar.Even with this World Cup sandwiched in the middle of the European season, there's always a demarcation line between club and national team duty. Sometimes a brief change of scenery does wonders. Players struggling at club level often find their feet for their countries.As much as Ronaldo is a cold-blooded businessman — he didn't return last year to Manchester, where he first became a household name, out of sentiment; they were simply his best option after he walked out on Juventus — he genuinely seems to love playing for Portugal.  It's easy to forget how an injured Ronaldo willed his compatriots on from the sidelines during their upset of host France in the 2016 Euro final? In all the post-match pictures, a smiling No. 7 is front and center holding the trophy in his arms. That he was subbed out in the first half is a mere footnote now.While much of Ronaldo's frustration with United is over the fact that the Red Devils didn't qualify for the Champions League this season, the World Cup offers him the biggest stage of all. Portugal's roster is stacked heading into Qatar. Only six teams have a better chance of winning this World Cup according to FOXBet, which gives Portugal the same odds as the three-time finalist Netherlands and shorter ones than Belgium.Not only is Ronaldo still a starter and the captain for the Seleção, but Portugal's core knows exactly how to maximize his strengths in an attack that has been built around him for the better part of two decades. When he gets adequate service, Ronaldo still knows how to put the ball in the net. He was third in the Prem last season with 18 goals.Can Ronaldo really turn back the clock in his final act? Unlikely as it seems on recent form, it's possible. The bigger question is what happens if Ronaldo is relegated to a supporting role. Could he accept being a super sub on a legit World Cup contender? Hard as that is to imagine after all the recent me-first drama in Manchester, it's in his interests to fall in line if necessary. After all, Ronaldo would be the first man to hoist the World Cup over his head Dec. 18 in Doha if Portugal can go all the way, a feat Messi could never match. Don't think he doesn't know it.Debate what Ronaldo has left in the tank all you want. Just know he'll have all the motivation in the world in Qatar.Doug McIntyre is a soccer writer for FOX Sports. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports and he has covered United States men’s and women’s national teams at multiple FIFA World Cups. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Martin Rogers","title":"'It is a tense time': World Cup turnaround carries injury risk","description":"The timing of this year’s World Cup has allowed no room for either error or mishap, with the MLS Cup final falling just a couple weeks before the tournament opener.","url":"https://www.foxsports.com/stories/soccer/it-is-a-tense-time-world-cup-turnaround-carries-injury-risk","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/11.2.22_Kellyn-Acosta_Newsletter_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-02T14:23:00Z","content":"Raphael Varane had friends close by, offering consolation and condolence, but the flow of tears wouldnt stem. He pulled the neck of his jersey upward, to the bridge of his nose, defeated, deflated, u… [+5319 chars]","fullContent":"   Raphael Varane had friends close by, offering consolation and condolence, but the flow of tears wouldn’t stem. He pulled the neck of his jersey upward, to the bridge of his nose, defeated, deflated, unable to comprehend the cruelty of fate’s hand. This took place on Oct. 22, and moments earlier, as Varane – a defender for Manchester United and the France national team – lunged for the ball as Chelsea’s Pierre-Emerick Aubameyang sped alongside him, he felt something pop in his knee. Just like that, one of soccer’s finest players was ruled out of the sport’s greatest tournament, hence the on-field tears. In that moment, his situation became the manifestation of a potential nightmare lurking in the minds of every athlete preparing for the World Cup, now just 17 days away. \"You know what’s going on, you know where we are at and how close we are and you see the stuff that’s happened,\" Kellyn Acosta, midfielder for the United States national team and one of the men desperately wishing to avert the curse that struck Varane, told me on Tuesday. \"It is a tense time.\" [USMNT Stock Watch: McKennie injury puts pressure on reserves]This Saturday, Acosta will take the field for LAFC in the MLS Cup final (Saturday, 4 p.m. ET on FOX and the FOX Sports App), matching up against the Philadelphia Union in what will be the biggest game of his nine-year professional career. The biggest … until that distinction is bettered, a couple of weeks later, assuming he takes part in the USA’s World Cup opener against Wales at Al Rayyan Stadium in Qatar. Acosta is in a spot where there is only one correct course of action, but it is one that flies directly in contradiction to human nature. Top-level soccer allows for no quarter given, no holding back, no reservation, no caution. Namely, no such thing as playing to avoid injury. But try adopting such a devil-may-care attitude when the World Cup is all you’ve thought of these past months. Or if you’ve seen Varane – a four-time Champions League medalist and a 2018 World Cup winner – break down in front of tens of millions on live television. \"For all of us the World Cup is a dream,\" Acosta added. \"It is like a childhood dream and we are at a kind of countdown now. \"But if you go into a game playing not to get injured, then more than likely you are going to get injured. You just can’t do that.  \"For me, I have just channeled it into maintaining the things that I can do right, and being mindful of the little details, like eating right and resting well. I am not going to be saving any energy. It is the MLS Cup and this is what we have dreamed of as well. This is what the club set out to achieve.\" The nature and timing of this year’s World Cup has allowed no room for either error or mishap. For example, the last English Premier League game before the World Cup-imposed pause, is on Nov. 13. Six days later, the most fervent showpiece in sports kicks off, when host nation Qatar takes on the Netherlands. There are no long pre-event training camps. No slow acclimation. No backstop period for minor knocks and strains to heal in time for the opening game. Just straight into it. \"You can see the wheels turning for these players every game,\" former USMNT star and FOX analyst Alexi Lalas told me via telephone. \"They are human. Don’t think for a second they aren’t thinking that every tackle or sprint puts at risk the possibility of living out their dream. \"It doesn’t matter how rich and famous they are. These are men who have thought about the World Cup since they were boys. It is impossible to turn it off. The more out of your mind it is, the better, but that is easier said than done.\" [France star Paul Pogba ruled out of World Cup with knee injury]Acosta is trying hard to keep it from his thinking. LAFC’s story this season is a mightily impressive one and the club, which began play in 2018 as an expansion franchise, has the chance to add its first major trophy in front of its own raucously passionate supporters, at Banc of California Stadium. A place in the final was assured with a 3-0 cruise past Austin FC last weekend, but Saturday’s visitors from Philly are not to be taken lightly, having surged back from a goal down to blow away New York City FC to decide the Eastern Conference bracket. \"I am staying present, although it is hard,\" Acosta said. \"If you had told me when I was 14 that I would be playing an MLS Cup and have the chance to go to a World Cup right after, I would have thought you were crazy.\" It is a thrilling time for soccer fans, for nothing gets the juices flowing like a World Cup, a global extravaganza that holds a transfixing effect on social life in virtually every corner of the planet for an entire month. It is the event every player wants to be part of, so important that missing it through a late flutter of misfortune would be nothing short of a heartbreaker. As for poor Varane, it turns out, he has been rehabbing exhaustively and, in defiance of medical prediction, might be able to make it onto France’s squad after all.  Either way, his plight is one no player wants to entertain, amid this strange time when the most important part of getting ready for the tournament of your life is to just stay healthy. Even when the best way to do that is not to try to do it at all. Read more on the World Cup:Martin Rogers is a columnist for FOX Sports and the author of the FOX Sports Insider newsletter. Follow him on Twitter @MRogersFOX and subscribe to the daily newsletter.     Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more   in this topic  United States     "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Champions League: 5 things we learned from Matchday 4","description":"FC Barcelona live, Mohamed Salah shines and three more of Doug McIntyre's takeaways from Champions League Matchday 4.","url":"https://www.foxsports.com/stories/soccer/champions-league-5-things-we-learned-from-matchday-4","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/10.12.22_Things-We-Learned-from-Champions-League_soccer-16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-13T02:49:44Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nWith just two more rounds of games remaining in the group stage of the 2022-23 UEFA Champions League, the knockout phase picture is beginning to come into … [+5572 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"LAFC inch closer to MLS Cup with 3-2 win over Galaxy","description":"With a clutch win over the Galaxy, LAFC showed why they're the favorites to win the MLS Cup, Doug McIntyre writes.","url":"https://www.foxsports.com/stories/soccer/lafc-inch-closer-to-mls-cup-with-3-2-win-over-galaxy","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/lafc1.jpg?ve=1&tl=1","publishedAt":"2022-10-21T07:04:10Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nWhat began less than a week ago as a 14-team MLS Cup playoff field is now down to six.\r\nLAFC and the Philadelphia Union the regular season conference champ… [+5716 chars]","fullContent":"   By Doug McIntyreFOX Sports Soccer WriterWhat began less than a week ago as a 14-team MLS Cup playoff field is now down to six.LAFC and the Philadelphia Union — the regular season conference champions and the tournament's two highest seeds — became the first two clubs to advance to the semifinals Thursday. LAFC beat its crosstown rival LA Galaxy in typically dramatic fashion while Philly narrowly outlasted upstart FC Cincinnati. The other two quarterfinals will be played on Sunday. Here are four quick thoughts on Thursday's games.LAFC takes thrilling Tráfico, edges closer to MLS Cup The most eagerly anticipated match of these playoffs so far more than lived up to the billing. Twice LAFC took the lead. Twice the Galaxy clawed their way back to equalize, before Cristian Arango finally put Javier \"Chicharito\" Hernandez & Co. away with the winner in second half stoppage time:We've come to expect this sort of drama when these two teams meet — the only other playoff between them, in 2019, ended 5-3 for LAFC — but that doesn't mean anyone should take Thursday's outcome for granted. After all, the last two teams to win the Supporters Shield before Steve Cherundolo's team did it this season were eliminated in their first playoff test. Despite LAFC's regular season crown, the Galaxy were in better form coming into the match. They looked fully capable of pulling off the upset in extra time or penalties until Arango's last gasp strike. The hosts' victory was hard-earned, though. And they got it by displaying exactly the sort resilience they'll need to get past either Austin or Dallas in the Western Conference final — and if they do, to claim the trophy they want the most on Nov. 5.Unfinished business for PhiladelphiaThe Philadelphia Union did on Thursday what they've done all year. They won at home, and they did it by being their usually stingy selves in a hard-fought 1-0 victory over former Philly assistant coach Pat Noonan's FC Cincinnati. Leon Flach scored the only goal the Union needed in the 59th minute.As expected, it was a tight affair between two of the best-drilled teams in MLS. The visitors gave the East's No. 1 see all they could handle, and they too were superb defensively, limiting a team that scored a league-best 72 goals during the regular season to Flach's lone strike. That said, Philadelphia never really looked like they wouldn't find a way to survive and advance — even without captain Alejandro Bedoya, who missed the match with a hip flexor.Having both the best back four in the league – Philly conceded fewer goals than any other team, too – and the best guy in net helped. When central defender Jack Elliott lost the ball to FCC striker Brandon Vazquez with just eight minutes to go, league MVP finalist Andre Blake, named MLS's goalkeeper of the year on Wednesday, was there to swat away Vazquez's shot and preserve the lead.Now the Union return to the East final, where they'll face the winner of Sunday's match between Montreal and New York City FC. It was the Pigeons who ended favored Philly's 2021 season at the same stage after Curtin's roster was decimated by a COVID outbreak. Nobody has forgotten. This is a team on a mission. \"We've proven we're a great team,\" Bedoya said in the lead-up to Thursday's contest. \"Now we have to prove we're a championship team.\" Two more wins, and MLS Cup is theirs.Galaxy left wondering what could have beenWhen substitute Dejan Joveljić pulled the visitors level with just five minutes remaining in Thursday's loss, the Galaxy looked like they might just pull off the upset. Despite giving up goals to Denis Bouanga on either side of halftime, Gregg Vanney's team was in it until the bitter end.That's little consolation in the immediate aftermath. The five-time MLS Cup champs genuinely thought that another title was a realistic goal once they qualified for the postseason for just the second time since 2016. Those feelings surely grew when they dispatched Nashville in round one to set up Thursday's Tráfico.The playoffs are all about momentum, and the Galaxy would've had plenty if Thursday had gone their way instead. Still, when the sting wears off, Vanney can be proud of how his squad ended their season. The former Toronto FC boss completely revamped his roster over since taking over the club he once played for two seasons ago, and while more tweaks will be forthcoming this winter, for the first time in a long time the Galaxy appear to be on the right track.A season to build on for Cincinnati The stat line says it all. From start to finish on Thursday in Chester, Pennsylvania, FC Cincinnati gave Philadelphia everything they could handle. They had more of the ball. They completed more passes. They put more shots on target.When the final whistle sounded with them on the losing end, the FCC players had every right to be devastated. That says a ton, too. For an organization that was a tire fire through its first three playoff-less seasons, 2022 was an expectation-changing about-face under first-year coach Noonan and new general manager Chris Albright.Nobody was surprised when Cincy bounced the higher-seeded New York Red Bulls last weekend in the first postseason game in club history. Behind the most dangerous attacking trio in the league (Vazquez, playmaker Luciano Acosta and Brazilian forward Brenner) Albright and Noonan have assembled a squad littered with proven MLS players who fight for each other. This team clearly is on the come-up. Despite Thursday's bitter defeat, 2022 was a major step in the right direction for Cincinnati. They'll be an even harder out next year.One of the leading soccer journalists in North America, Doug McIntyre has covered United States men’s and women’s national teams at multiple FIFA World Cups. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports. Follow him on Twitter @ByDougMcIntyre.    Get more from MLS Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"World Cup's 101 Most Memorable Moments: Game of the century","description":"Italy and West Germany combined for five goals in extra time in the 197p World Cup semifinal.","url":"https://www.foxsports.com/stories/soccer/world-cups-101-most-memorable-moments-game-of-the-century","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/09.13.22_101-Most-Memorable-WC-Moments_14_16x9.jpg?ve=1&tl=1","publishedAt":"2022-11-07T07:47:06Z","content":"Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup\r\n on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continue… [+1722 chars]","fullContent":"   Editor's note: Each day between now and the kickoff of the first match of the 2022 FIFA World Cup on Nov. 20, we'll unveil a different memory from World Cup history. The countdown from 101 continues with the \"Game of the century\" between Italy and West Germany.No wonder they called it the Game of the Century. Tied 1-1 at the end of 90 minutes in their 1970 World Cup semifinal in front of more than 100,000 fans at Azteca Stadium in Mexico City, West Germany and Italy exploded for five goals during the half-hour of extra time, with the Azzurri ultimately prevailing on Gianni Rivera’s 111th minute winner.Italy had led for most of the match. But Germany equalized via defender Heinz Schnellinger in second half stoppage time, and German striker Gerd Müller took full advantage of the stunned Azzurri players when he gave his team a 2-1 lead early in the extra session. Italy responded, and things were all square again when they made it 2-2 just four minutes later.Gigi Riva then put Italy up 3-2, and it seemed that would settle it — until a defensive error by Rivera allowed Müller to level the score for Die Mannschaft once again. Just nine minutes before a drawing of lots that would determine which team advanced to the final (FIFA didn’t introduce the penalty kick tiebreaker until the 1974 World Cup), Rivera made up for his error to put Italy ahead for good.Never before had five World Cup goals been scored during extra time, let alone between two of the sport’s most decorated teams with a spot in the final at stake. The record stands to this day. Does Game of the Century do it justice? If not, Best World Cup Game Ever works, too.Game of the Century       \n    Germany and Italy combined for five goals in extra time in the 1970 World Cup semifinal.\n  Doug McIntyre is a soccer writer for FOX Sports. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports and he has covered United States men’s and women’s national teams at multiple FIFA World Cups. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"Does Jordan Pefok still deserve USMNT call-up for World Cup?","description":"Jordan Pefok's World Cup case isn't as strong as it was when he was left off of the USMNT roster in September.","url":"https://www.foxsports.com/stories/soccer/does-jordan-pefok-still-deserve-usmnt-call-up-for-world-cup","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/pefok1.jpg?ve=1&tl=1","publishedAt":"2022-11-03T23:39:18Z","content":"Jordan Pefok was one of the most prolific goalscorers in the German Bundesliga to start the 2022-23 campaign, and undoubtedly the most in-form striker in the United States men's national team player … [+1886 chars]","fullContent":"   Jordan Pefok was one of the most prolific goalscorers in the German Bundesliga to start the 2022-23 campaign, and undoubtedly the most in-form striker in the United States men's national team player pool, which made his omission from Gregg Berhalter's September roster head-scratching.Now, with other USMNT strikers hitting their stride and Pefok failing to score in his last eight appearances for Union Berlin, would Pefok's exclusion from the 26-man World Cup roster still be considered a snub? FOX Sports soccer analyst and former USMNT defender Alexi Lalas shared his thoughts on the \"State of the Union Podcast.\"\"Whenever we talk about these forwards, it’s relative to them putting the damn ball the net, okay?\" Lalas said. \"So if that’s what your argument is for Pefok, he hasn’t scored in eight games. I don’t understand that. And there are those that say ‘yes, but he provides a different look,’ and I am one of those. Does it have to be Pefok? I don't know.\"But if your argument was always ‘well this guy’s scoring,’ or if your argument against a player is ‘well he’s not scoring’ — if it’s just about scoring goals, then Pefok shouldn’t even be on the plane right now because he’s not in form. He’s not scoring. I know I’m being a little flippant and simplistic when it comes to this but, in particular — with this position — it’s about scoring goals and if you’re not scoring goals, then don’t make the argument that he should or shouldn’t be there relative to putting the ball in the back of the net.\"Has Jordan Pefok done enough to receive call from Gregg Berhalter?       \n    After failing to score in eight straight games for Union Berlin, Alexi Lalas and David Mosse debate whether Gregg Berhalter should bring Jordan Pefok to the 2022 FIFA World Cup for USMNT. \n  Union Berlin have just one more game before the USMNT's roster announcement on Wednesday, so unless Berhalter already has a seat reserved for Pefok on the plane, or another striker sustains an injury, it might be hard for Pefok to make up the ground he's lost between him and the rest of the pack — namely Ricardo Pepi, who's scored five goals in seven games since moving to the Dutch first league.[USMNT Stock Watch: McKennie injury puts pressure on midfield reserves]You can watch the \"State of the Union\" podcast on YouTube or subscribe on podcast platforms, including Apple Podcasts.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"World Cup injury watch: Richarlison, Reece James, Diogo Jota, Paul Pogba - Who's out? Who's a doubt?","description":"BBC Sport's World Cup injury watch provides an at-a-glance guide to who's out and who's a doubt for Qatar 2022 this winter.","url":"https://www.bbc.co.uk/sport/football/63284462","urlToImage":"https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/3544/production/_127163631_jamespogba_getty.png","publishedAt":"2022-10-17T13:08:14Z","content":"The Qatar 2022 World Cup starts on 20 November - with a unique winter build-up meaning many of the world's top stars playing club football right up until a week before the tournament starts.\r\nEngland… [+6668 chars]","fullContent":"The Fifa World Cup 2022 starts on 20 November - with a unique winter build-up meaning many of the world's top stars are playing club football right up until a week before the tournament starts.England already have their own defensive worries and a packed domestic schedule will surely mean further scares for manager Gareth Southgate, with Wales boss Rob Page also closely monitoring his squad.But which other countries have real worries over the fitness of their key men?BBC Sport attempts to keep track....EnglandDominic Calvert-Lewin: The Everton striker limped out of their 2-0 defeat to Leicester with a 'hamstring problem' and will undergo a scan. After the Toffees' EFL Cup defeat by Bournemouth on Tuesday, manager Frank Lampard said he would be \"very surprised\" if Calvert-Lewin was fit for Saturday's Premier League tie against the Cherries.Reece James: The Chelsea man says he is \"devastated\" to miss the World Cup after suffering a knee injury against AC Milan last month. Despite being ahead of schedule in his recovery, England manager Gareth Southgate has deemed it too big a risk to take the 22-year-old.Kyle Walker: The Manchester City defender was left with six weeks to recover his fitness after groin surgery - but says he is \"confident\" of making the World Cup squad.Kalvin Phillips: The Manchester City midfielder is a major doubt after a dislocated shoulder suffered in September but City manager Pep Guardiola said Phillips is \"optimistic\" about being fit in time for the tournament.Kyle Walker-Peters: The Southampton full-back is set to be out until the end of the year with a hamstring injury sustained in Saints' 1-0 win over Bournemouth in late October.Ben Chilwell: The Chelsea left-back has confirmed he will miss the tournament after suffering a \"significant\" hamstring injury in the Blues' Champions League win over Dinamo Zagreb. WalesGareth Bale: The star forward should be fit to lead Wales' first World Cup campaign in 64 years despite appearing sparingly for Major League Soccer side Los Angeles FC. The 33-year-old says he is \"not 100% fit\" but is \"feeling better as time goes on\" after coming off the bench to score a 128th minute equaliser before LAFC beat Philadelphia Union on penalties to win the MLS Cup on 5 NovemberTom Lawrence: The Dragons will be without the Rangers forward in the Gulf state after he aggravated a knee injury that has ruled him out until after the tournament.Joe Allen: The veteran midfielder has not played for Swansea in more than a month after going down with a hamstring problem but Swans boss Russell Martin said \"he has a chance\" of being fit in time.Rhys Norrington-Davies: The defender has been a key performer under Wales boss Robert Page, but is set to miss the World Cup after Page confirmed the Sheffield United player has picked up a \"significant\" hamstring injury.Tom Lawrence has scored three goals in 23 international caps for WalesFranceDidier Deschamps' defending champions have arguably the largest injury list - from an admittedly frighteningly strong squad - of any country heading into the four-week event.N'Golo Kante: The defensive midfielder will miss the World Cup following surgery to correct a hamstring problem.Paul Pogba: The former Manchester United midfielder will also not feature at the tournament as he needs more time to recover from knee surgery for an injury sustained soon after his summer return to Juventus.Wesley Fofana: Kante's Chelsea team-mate limped off during the 3-0 Champions League home win over AC Milan and is unlikely to play for the Blues before the World Cup.Lucas Hernandez: The Bayern Munich utility man injured his groin in a Champions League victory over Barcelona last month but is closing in on a return to fitness.Raphael Varane: The 29-year-old left the pitch in tears during Manchester United's 1-1 draw at Chelsea after suffering a leg injury. Manager Erik ten Hag said he will be out until the tournament but they will have to \"see how his rehab will develop\" whether he will be fit in time.Anthony Martial: Forward Martial has recently returned to training following a back injury but Ten Hag says it is \"difficult to say\" when the 26-year-old will feature again.BrazilOne Premier League player remains a major doubt for a Brazil side looking to lift the World Cup for the first time since 2002, but injured Richarlison is now likely to compete.Richarlison: The Tottenham forward was seen on crutches after suffering a calf injury in Spurs' 2-0 win over Everton on 15 October, but Tottenham boss Antonio Conte says the Brazil forward should be available for the World Cup following a scan. Richarlison added on Twitter:external-link \"Guys, thank God it was just a big scare!! Two weeks and I'll be back! Thank you for the messages and affection.\"Portugal Manager Fernando Santos could be deprived of the services of four important players for their Group H campaign against Ghana, South Korea and Uruguay.Diogo Jota: The Liverpool forward will miss the World Cup after he was taken off on a stretcher with a thigh injury in added time of their 1-0 Premier League win over Manchester City on 18 October.Pedro Neto: Wolves said the 22-year-old striker will miss the World Cup after an ankle injury sustained against West Ham on 1 October left him requiring surgery.Pepe and Nuno Mendes: Porto expect 39-year-old Pepe to miss several games with a sprained knee, while fellow defender Mendes will be out for a few weeks with a muscle issue.GermanyWith one key striker already ruled out the Germans' main worries centre on a Die Mannschaft stalwart with 48 caps and 15 international goals to his name and a Bayern Munich forward in good form.Timo Werner: The 26-year-old will miss the tournament after suffering an ankle injury in RB Leipzig's 4-0 Champions League win over Shakhtar Donetsk on 2 November.Marco Reus: The 33-year-old Borussia Dortmund skipper damaged ankle ligaments in September. An ankle injury also kept him out of Germany's World Cup triumph in Brazil in 2014. He returned for Dortmund in their 2-0 defeat to Union Berlin but has since suffered another setback. Leroy Sane: The 26-year-old tore his left thigh muscle during Bayern Munich's 5-0 win over Freiburg but returned to training in early November and is expected to be fit.Manuel Neuer: The veteran goalkeeper suffered a shoulder injury in October but returned to action in Bayern's Bundesliga game against Hertha Berlin on 5 November.Netherlands The Netherlands, a potential last-16 opponent for England or Wales, will also be missing an experienced international operator.Georginio Wijnaldum: The 31-year-old former Liverpool midfielder, capped 86 times, suffered a fractured tibia in his right leg after just playing one game on loan at Roma.Georginio Wijnaldum was part of the Netherlands squad that finished in third place at the 2014 World CupSpainKepa Arrizabalaga: Chelsea manager Graham Potter confirmed the goalkeeper won't play for the Blues until after the tournament after suffering a foot injury in the 4-1 defeat by Brighton in October.ArgentinaThe 2014 runners-up have a handful of concerns but have been boosted by the return of a key forward.Paulo Dybala: The 28-year-old was expected to miss the competition after picking up a freak thigh injury while taking a penalty for Roma in Serie A in early October, but is now due to undergo tests and could be available.Angel di Maria: The former Manchester United winger also suffered a thigh injury on Champions League duty for Juventus but could still make the tournament.Giovani lo Celso: The 26-year-old Tottenham midfielder - on loan at Villarreal - has 41 caps for his country but looks set to miss the tournament after coming off in a 1-0 defeat to Athletic Bilbao with a muscle injury on 30 October.United StatesThe US, Group B opponents of England and Wales, have key injuries at either end of the pitch.Chris Richards: The Crystal Palace defender will miss out with an ongoing leg injury that has sidelined him since August. He tweeted: \"Gutted that this injury has ruled me out of the World Cup but I know that the boys will go crazy regardless ... will be rooting for y'all the whole way.\"Daryl Dike: The West Bromwich Albion striker has been out with a thigh issue since August but has recently returned to training and could feature in Qatar.Miles Robinson: An Achilles tendon tear has ruled out the Atlanta United centre-back.SenegalSadio Mane: The Bayern Munich striker left the field after 20 minutes of their 6-1 win over Werder Bremen on 8 November, 13 days before his country's first game against the Netherlands.MexicoBoss Gerardo Martino has huge concerns over two of his top stars, but says he will give both until the very last minute to prove their fitness.Raul Jimenez: The Wolves forward has not played since 31 August due to a groin injury and faces a race against the clock to be fit.Jesus Corona: Winger Corona broke his leg in August and despite recovering ahead of schedule, Sevilla coach Jorge Sampaoli said he will not be fit in time to play for Mexico at the World Cup.South KoreaSon Heung-min: The Tottenham forward is confident of playing some part in the finals after undergoing successful surgery on a fracture around his left eye. He had to be replaced after he suffered a blow to the head in his side's final Champions League group match against Marseille on 1 November. Spurs boss Antonio Conte, said: \"Now, he is at home. I am confident, confident that he can come back quickly and play the World Cup for South Korea.\"CroatiaMarcelo Brozovic: The Inter Milan midfielder has not played in almost a month after coming off with a thigh injury during Croatia's Nations League win over Austria in September but is on the brink of a return to action.UruguayRonald Araujo: Barcelona stated in September the defender would likely miss the tournament due to surgery on a torn thigh muscle but the 23-year-old has been included in Uruguay's preliminary World Cup squad.PolandJakub Moder: The Brighton midfielder will not feature for the Poles in Qatar after rupturing his anterior cruciate ligament in April.CanadaAtiba Hutchinson: The Canada captain, 39, has not played at all this term for his club side, Turkish outfit Besiktas, after suffering a bone bruise in pre-season but is expected to be fit in time to play in Qatar.Alphonso Davies: The Bayern Munich full-back, 22, will miss his club's next two games with a hamstring injury but his World Cup participation is \"not in danger\".MoroccoImran Louza: Watford midfielder Louza, 23, will miss the tournament after breaking his leg against Millwall in mid-October.JapanYuta Nakayama: The Huddersfield Town defender will miss the World Cup after being ruled out for the rest of the season with an Achilles injury.Our coverage of your Premier League club is bigger and better than ever before - follow your team and sign up for notifications in the BBC Sport app to make sure you never miss a moment"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"USMNT Stock Watch: Is Tim Ream in the mix with Aaron Long slipping?","description":"Time is running thin. With just a few more weeks to go, there is still enough for a bit more movement yet.","url":"https://www.foxsports.com/stories/soccer/usmnt-stock-watch-is-tim-ream-in-the-mix-with-aaron-long-slipping","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/10.18.22_Plane-to-Qatar_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-18T23:09:46Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nEditor's Note:Plane to Qatar is FOX Sports weekly feature tracking the progress of players trying to crack the United States mens national teams 26-player … [+9361 chars]","fullContent":"   By Doug McIntyreFOX Sports Soccer WriterEditor's Note: Plane to Qatar is FOX Sports’ weekly feature tracking the progress of players trying to crack the United States men’s national team’s 26-player roster for the 2022 FIFA World Cup.Just over three weeks before Gregg Berhalter names the first USMNT World Cup roster in eight years, we have movement. Center back Chris Richards didn’t dress Tuesday for Crystal Palace’s Premier League game against Wolverhampton, the sixth-straight match he’s missed. The 22-year-old has played just 134 first-team minutes since Aug. 5. At this late stage, it’s probably not realistic to think that he’s going to be anywhere near fit enough to contribute when the Americans kick off their World Cup campaign against Wales on Nov. 21.The situation in central defense remains hugely problematic for Berhalter. Aaron Long, a starter in each of the last six U.S. games, didn’t perform well in any of them, wasn’t good in the New York Red Bulls' Oct. 15 MLS playoff loss to Cincinnati, and now won’t play another competitive match before Qatar. Long has been given every opportunity but has not proved that he can start next to Walker Zimmerman — who’s been good for club and country all year, though his Nashville SC side also were eliminated last weekend — at the highest level without being exposed.Belgium-based Mark McKenzie is the most likely replacement for Richards on the roster. Cameron Carter-Vickers is the presumed front-runner to take the starting spot next to Zimmerman. Does Long still have a seat on the plane? Only Berhalter knows, but it’s possible that the current circumstances, combined with the USMNT’s poor showings last month against Japan and Saudi Arabia, could have the coach reconsidering veteran Tim Ream, who hasn’t represented his country in more than a year.Ream isn’t the sort of fast, physical center back Berhalter prefers. But he’s smart, universally respected, a terrific passer with his left foot, and, at age 35, is playing the best soccer of his career. He's also captaining a midtable team in the Prem where week-in, week-out he faces many of the same forwards the U.S. will see at the World Cup.It’s a long shot, to be sure. Time is running thin. With just a few more weeks to go, there is still enough for a bit more movement yet. First classF/M Brenden Aaronson (Leeds): The 21-year-old winger went the distance for just the third time this season in Sunday’s 1-0 loss to English leaders Arsenal.M Tyler Adams (Leeds): Destroyer Adams has been an iron man for Leeds, playing all 810 Premier League minutes so far. He also went the full 90 against the Saudis in the Americans’ final World Cup tune-up.D Sergiño Dest (AC Milan): The projected U.S. right back continues to occupy a peripheral role for the Rossoneri, which can’t help his form next month. Dest didn’t play in Sunday’s loss to Verona, the fourth time in six Serie A games he hasn’t left the bench.F Jesús Ferreira (Dallas): The striker buried his spot kick — his first as a pro — as FCD staved off elimination from the MLS playoffs in Monday’s shootout win over Minnesota. Ferreira struggled in open play, but he’ll get another chance (and at least one more game before the World Cup) Sunday at Austin.M Weston McKennie (Juventus): McKennie hasn’t been good lately, but he did go the distance in Juve’s desperately needed 1-0 derby win over Torino on Saturday.M Yunus Musah (Valencia): The 19-year-old made his second straight start since returning from a groin injury, going 74 minutes in Tuesday’s chippy 1-1 draw at Sevilla. F Christian Pulisic (Chelsea): After scoring his first goal of the season against Wolves on Oct. 8. Pulisic DNP in either of the Blues’ next two games. Chelsea visits Brentford on Wednesday.F/M Giovanni Reyna (Borussia Dortmund): Still looking for his first Bundesliga start this season, the teenager — Reyna turns 20 next month — entered for the final eight minutes of Sunday’s 2-0 loss to Union Berlin.D Antonee Robinson (Fulham): The left back lock hasn’t missed a beat since returning from the high ankle sprain he suffered last month, playing all of Fulham’s last two games.F Tim Weah (Lille): A week after returning from an ankle issue of his own, Weah recorded two assists off the bench in last week’s 3-0 victory over Strasbourg.D Walker Zimmerman (Nashville): He’s still a likely starter, though there is understandable concern that a month-plus layoff between games could affect Zimmerman’s sharpness and rhythm.Comfort PlusM Kellyn Acosta (LAFC): The feisty defensive midfielder and LAFC take on the cross-city rival LA Galaxy on Thursday night (10 p.m. ET, FS1/FOX Deportes/FOX Sports app).M Paul Arriola (Dallas): Arriola was superb on Monday against the Loons before being subbed in extra time with what looked like a leg cramp.D Cameron Carter-Vickers (Celtic): He’s been rock-solid for Scotland’s best team all season when healthy, and he shut down newly-minted Ballon d’Or winner Karim Benzema in the Champions League last month.*D Reggie Cannon (Boavista): Like Richards, the right back/right CB is running out of time. He’s now missed his Portuguese club’s last three games.M Luca de la Torre (Celta Vigo): Things are not trending well for De la Torre, who didn’t play at all in Celta’s last two La Liga matches. Keep an eye on him.G Sean Johnson (New York City): Johnson backstopped the Pigeons into the Eastern Conference semifinals on Monday. NYCFC will try to extend their season again Sunday in Montreal.D Aaron Long (New York Red Bulls): Long was torched by FCC forward (and possible future USMNT striker) Brandon Vazquez on the goal that ended the Red Bulls season. Not good. ^D Mark McKenzie (Genk): The 23-year-old is certainly match fit; McKenzie started his 10th straight club match Tuesday, a 6-1 win over Westerlo.M Jordan Morris (Seattle Sounders): How (or if) Seattle’s failure to reach the playoffs impacts Morris’s World Cup roster chances remains to be seen. F Ricardo Pepi (Groningen): The 19-year-old striker didn’t register a goal or assist for the first time in his five Eredivisie games. He did log 90 minutes for the second straight match.*F Josh Sargent (Norwich City): Sargent scored a fine goal over the weekend and is currently the joint goals leader in England’s second tier. But he was pulled midway through Tuesday’s match against Luton after a hard first-half tackle. Norwich manager Dean Smith suggested afterward that the injury didn't appear serious. \"I expect him to be back on Saturday\" against Sheffield United, Smith said of the striker.D Joe Scally (Borussia Monchengladbach): Another week, another 90 minutes in the Bundesliga for the versatile fullback, whose chances would only increase if Cannon can’t go. Scally also started for ‘Gladbach in Tuesday’s German Cup loss to Darmstadt.G Zack Steffen (Middlesbrough): Playing every week (unlike Matt Turner) and steadily improving after a rough start at Boro, the on-loan Manchester City backstop could well be the U.S. starter in Qatar.G Matt Turner (Arsenal): Turner has been terrific in the Europa League for the Gunners. Will that be enough for Berhalter? D DeAndre Yedlin (Miami): The veteran right back’s season ended with Monday’s playoff loss in New York City. Yedlin and his fellow eliminated MLSers will report to the USMNT’s hush-hush pre-World Cup camp later this month.Standby listM Johnny Cardoso (Internacional): The two-way central midfielder continues to start for Brazil’s second-best team.G Ethan Horvath (Luton Town): Horvath made one save — on Sargent — to secure his fifth clean sheet of the season in Tuesday’s win over the Canaries.M Djordje Mihailovic (Montreal): Back on the list but still highly unlikely to make the final 26. There is one possible path for Mihailovic, though: If he leads Montreal all the way to MLS Cup and fellow playmaker De la Torre continues to sit in Spain.D Erik Palmer-Brown (Troyes): EPB wasn’t in Troyes’ lineup Sunday for the first time in 10 Ligue 1 games. He did come on halfway through the 1-1 tie with Ajaccio.F Jordan Pefok (Union Berlin): The target striker looked like one in setting up Berlin’s backbreaking second goal against Dortmund. He’s still behind Ferreira, Pepi and Sargent on Berhalter’s depth chart. Whether he should be is another matter.⌄*D Chris Richards (Crystal Palace): It looks over for Richards barring a miraculous recovery plus some Premier League minutes within the next couple of weeks.D Tim Ream (Fulham): Ream has played all but two minutes for 11th place Fulham.M Cristian Roldan (Seattle Sounders): Luck hasn’t been on Rhodanus' side over the last few months. This upcoming U.S. camp represents his last chance to earn a ticket to Qatar. M Malik Tillman (Rangers): While Tillman, 20, scored a beautiful solo goal Sunday in Scotland’s Premiership, his mostly anonymous Champions League performances won’t be forgotten.D Sam Vines (Royal Antwerp): The left back was replaced 17 minutes into Sunday’s 3-0 loss to Standard Liege.F Haji Wright (Antalyaspor):  Wright scored twice in Turkey over the weekend. Despite seven goals in nine appearances — he’s now second in the Süper Lig behind Ecuador striker Enner Valencia — he still doesn’t appear to be in Berhalter’s plans.*Injured ^Bumped up⌄Bumped downAdded: Ream, MihailovicDropped: NoneDoug McIntyre is a soccer writer for FOX Sports. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports and he has covered United States men’s and women’s national teams at multiple FIFA World Cups. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more   in this topic  United States     "},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Paris, Barcelona or Miami - where next for Messi?","description":"Spanish football expert Guillem Balague takes a look at where Lionel Messi could be playing next season.","url":"https://www.bbc.co.uk/sport/football/63502135","urlToImage":"https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/8C46/production/_127501953_-11e1998c-6fc0-43f8-873d-0d817526861b.png","publishedAt":"2022-11-04T08:02:38Z","content":"With the World Cup inching ever closer, speculation as to the next destination of Lionel Messi continues apace. \r\nAt 35, the Paris St-Germain forward has won almost every accolade in the game. He has… [+8604 chars]","fullContent":"The Football News Show: What next for Lionel MessiWith the World Cup inching ever closer, speculation as to the next destination of Lionel Messi continues apace. At 35, the Paris St-Germain forward has won almost every accolade in the game. He has won the Ballon d'Or - awarded to the world's best player - a record seven times and also won the Fifa Best Men's Player award once.But where will the Argentine superstar be weaving his magic next season?Watch the documentary: 'Messi' is streaming now on iPlayerWatch The Football News Show - Lionel Messi: what's next?What is his current situation with PSG?Despite clearly approaching the latter stages of his career, Messi, with 11 goals and 14 assists from 17 Ligue 1 and Champions League appearances this season, is very much back to his frightening best.Messi and his family did not enjoy the happiest of departures from Barcelona, where he had starred for more than half his life, nor did he hit the ground running after his arrival at Paris in August last year.Shirt sales on his signing for the club exceeded those of Kylian Mbappe and Neymar when they came to PSG. Unfortunately the initial performances, affected by injuries, adaptation and a tough Covid infection, did not totally live up to all the hype.But as everything has fallen into place in his personal life then that has swiftly been reflected by his performances.Put simply, if PSG were to put a contract on the table and tell him it had to be signed there and then, Messi would do so. But with qualification into the knockout stage of the Champions League secured, his main focus is on the World Cup and he has asked everyone in his entourage not to talk about his future until after then. That could be January or June, but certainly after the tournament. Messi goes to Qatar carrying the hopes and dreams of the entire nation of Argentina, the main asset in what looks like an extremely good side built around him by coach Lionel Scaloni. They look very much like they could be there or thereabouts in the competition. For Messi this will be the perfect litmus test as to whether or not he still deserves his place among the elite, whether he is still up to the task in hand. Then he will decide at what level he wants to play.Messi's current contract, which runs until the end of June next year, was for two years plus an option of a third, although the extra year only comes into effect if both parties agree to it.As things stand PSG now realise more than ever his value both commercially and in a sporting context. If they sit down at the end of the World Cup he will be offered a further year's contract plus an option for a second year, rather than putting into effect the extra-year deal currently in place.The word coming out of Paris is that they are optimistic he will sign.What are his chances of joining MLS with Inter Miami?According to much of the UK media it is David Beckham's Inter Miami who are currently favourites to sign Messi when his contract with PSG finishes at the end of June.What is certain is that Inter Miami have everything in place to guarantee bringing him into Major League Soccer as soon as possible, which is completely different to saying that he will be joining them next season.What is almost certainly a done deal is the arrival of Sergio Busquets, Messi's great friend and former Barcelona team-mate. Inter Miami will feel by signing Busquets they will not only be getting a top player, but also someone for Messi to be close to and trust should he decide on the move. Messi may well at some time in his career decide that is where he and his family want to be, but next season? Very early to say. It feels like the stories about his move to the USA are driven by a club needing the attention to gather enough sponsorship for what's coming up for them.What are his chances of rejoining Barcelona?In a recent BBC documentary on Messi, Xavi said how much he would love to coach the Argentine. What is also certain is that the Barcelona coach is very much the engine driving the idea constantly being highlighted in Barcelona friendly sports media surrounding Messi's potential return.My feeling is that Xavi has already spoken to Messi and explained to him how he thinks he can help to make Barcelona a great power once again, particularly in the role of an attacking midfielder. Ever the pragmatist, club president Joan Laporta is not about to start dismissing any suggestions that he might return, and has spoken many times in general terms about how the Messi and Barcelona story is far from being finished. In fact, Xavi has previously insisted to Laporta that Messi was the piece missing in the team and that he wanted him back as soon as possible.Despite Xavi's desire to bring him back into the fold, and Laporta's encouraging words, there has been no contact between Laporta and Messi himself, or with his father and agent, since the tearful media conference where he said goodbye to the club after 18 years.There may well be people, especially on the Barcelona side, desperately trying to build bridges but the truth is that the response coming from the Messi camp is very cold indeed, and whatever happens he is going to need a lot of convincing if he is ever to return to the club as a player.To all intents and purposes Messi's contract with PSG comes to an end in less than eight months. If Barcelona were really serious about bringing him back then negotiations between all parties would by now be well down the road. At the moment there is nothing on the table, not even the merest hint of an offer, or the remotest sign of any commercial or financial strategy in place. And can you blame him for thinking twice about a return?Last season was traumatic, not just for Messi but his entire family, and one of the major reasons for that was the way his departure from the club was handled.Back in December, before presidential elections had taken place, he had discussions with his family where he told them they would be staying at Barcelona. Such was his desire not to rock the boat that in the light of the crisis the club was suffering he agreed to a 50% reduction in wages to facilitate the deal which, incidentally, was the maximum in law he could be compelled to accept. But not even that was enough to guarantee him staying, and just as he was ready to sign a new contract he was told by his father that Laporta had spoken to him and that it wasn't going to happen.In the end it was Barcelona's sporting vice-president Rafael Yuste who broke the news to Jorge Messi about Laporta's U-turn.Messi was left no choice other than to have another family meeting where he told them they would be leaving the club. He felt betrayed because he had done everything possible to ensure he could stay at Barcelona and then, to add insult to injury, the club created a false narrative that Messi's people had already been in discussions with PSG and were now tying a contractual noose around Barcelona's neck. The reality was simpler. Laporta had campaigned on a mandate that he would keep Messi at the club. Now elected, the club swiftly announced that the numbers did not add up. Messi and his whole family put a brave face on when they arrived in Paris but it could not mask the reality that in a perfect world all the Messi family, at the time, would have preferred to stay in Barcelona.For a month and a half his children had to live in a hotel which, luxurious as it was, was never a 'home' and far from ideal being one hour away from the training ground through the nightmarish Paris traffic.Then he was injured, and caught Covid, which brought with it a few pulmonary complications which slowed him down.How did he turn things around at PSG?In Paris, the family found themselves a place they could call home, and established a harmonious routine which sees his wife Antonela now working and his children going to school where they are learning French and English.He now looks comfortable on the pitch once again, playing where and how he wants, with most of the play going through him. It has benefitted the side even if it has also meant that both Mbappe and Neymar now have a slightly less influential role.Physically he feels great. He trains in the afternoon at home, and although he had a bit of a problem recently with his calf he has only missed the one game - against Stade Reims - because of it. He is back on form and knows he has to continue to play to maintain his sharpness, not just for the World Cup but also to keep the pressure on for PSG's pursuit of both the Ligue 1 title and their first ever Champions League crown.Many believe that the Qatar World Cup could become Messi's 'last hurrah'. Others, myself included, feel it could also be a springboard to the next chapter of his great career, and confirmation he is still a long way from waving goodbye to the world of elite football.Do longer prison sentences reduce crime? Bad People goes in search of answersThe champion of two courts ignored by the world: Ora Washington fought to make her name in racially segregated America"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Laken Litman","title":"5 NWSL stars who made their cases for USWNT's World Cup roster","description":"The Portland Thorns have a few players that could help the USWNT three-peat at the 2023 World Cup, Laken Litman writes.","url":"https://www.foxsports.com/stories/soccer/5-nwsl-stars-who-made-their-cases-for-uswnts-world-cup-roster","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/dunn1.jpg?ve=1&tl=1","publishedAt":"2022-10-31T18:14:51Z","content":"Sophia Smith was named MVP of the National Women's Soccer League on Friday and then led the Portland Thorns to their third league title on Saturday. The 22-year-old, who was the youngest player to ev… [+5633 chars]","fullContent":"   Sophia Smith was named MVP of the National Women's Soccer League on Friday and then led the Portland Thorns to their third league title on Saturday. The 22-year-old, who was the youngest player to ever win league MVP, scored one goal and was part of the other as the Thorns beat the Kansas City Current 2-0. Smith, who was also named MVP of the championship game, scored 15 total goals this season.Smith is a lock to play in her first World Cup next summer when the United States Women's National Team heads to Australia and New Zealand to defend their back-to-back titles. She's been consistently praised by USWNT coach Vlatko Andonovski, who has said that it would be difficult for anyone to take her starting spot, and has continued to show up in big moments for her club and national teams.While she didn't need much help raising her profile, Smith, who has 25 caps and 11 goals for the USWNT, is poised to breakout on the biggest international stage next summer.In addition to Smith, here are five other players who stood out this NWSL season and what that means for their chances in making the U.S. roster for next summer's World Cup.Adrianna Franch, 10 caps, 3 clean sheets, 1 World CupGoalkeeper Adrianna Franch has put herself in a strong position to make Andonovski's roster moving forward. She had an impresive NWSL season for the Kansas City Current, helping lead her team to a 10-6-5 record and ultimately to the championship match over the weekend. She gave up two goals in a 2-0 loss to the Thorns, but also made a stellar 15 saves during the playoffs.Franch, who recorded five clean sheets this season, has national team experience serving as Alyssa Naeher's backup during the 2019 World Cup and 2020 Olympics. She's also a two-time NWSL Goalkeeper of the Year and finished runner-up in 2022 to the Wave's Kailen Sheridan.Crystal Dunn, 125 caps, 24 goals, 1 World Cup appearanceCrystal Dunn must be on this list, especially after what she did in the Portland Thorns semifinal win over the Wave. Dunn, who gave birth to her son Marcel in May, scored the game-winning goal — an unstoppable right-footed rocket —  in stoppage time that sent her team to the championship game with a 2-1 victory. It was her first goal as a mom.Dunn started practicing two months after having Marcel and was back training with the national team in September ahead of two friendlies against Nigeria. She didn't play in those, but did get on the field in the USWNT's October matches against England and Spain. Dunn, who played an integral part in the USWNT's 2019 World Cup title run, has slowly been increasing her minutes and there's no reason to think she won't be back in top form next summer.Naomi Girma, 8 capsNaomi Girma, who was the No. 1 overall NWSL draft pick out of Stanford, has been one of the best defenders in the league all season. She had a breakout rookie season as the anchor of San Diego's back line — and was named NWSL Rookie of the Year and Defender of the Year — and all signs point to her being the future anchor of the USWNT's back line for many years to come.Girma is a force in the back who keeps possession, wins battles in the defensive third of the field and connects with the attack. She earned a spot on the USWNT's roster for the CONCACAF W Championship and played in four of those matches. She was a bright spot for the U.S. in its match against England in October, too, getting the start over captain Becky Sauerbrunn. Andonovski hasn't played those two together yet, mainly because they both favor the left side of the center back position, but don't be surprised if they start alongside each other at next summer's World Cup.Sam Coffey, 3 capsSam Coffey is a defensive midfielder who has solidified herself in the Portland Thorns starting lineup as a rookie — which is even more impressive considering she played more as an attacking mid in college at Penn State.She had an exceptional season for the championship-winning Thorns, and earned her first USWNT call up over the summer. Coffey made her USWNT debut in a September friendly against Nigeria and played in both matches against England and Spain. The Rookie of the Year candidate impressed Andonovski, who called her performance with the Thorns this season \"tremendous.\"\"In my opinion, she's a [NWSL] MVP candidate,\" Andonovski said earlier this year before the award was given to Smith. \"Sam has a lot of impact and sometimes dictates the performance of the team, which is incredible for a rookie.\"Sofia Huerta, 23 capsSofia Huerta was one of the best defenders in the NWSL this season, which is sort of ironic considering she's also played forward and midfield during her professional career. It wasn't until 2020 when Houston traded Huerta to OL Reign and coach Laura Harvey told her she wanted her to play full-back. That was the beginning of when Huerta, who solidified a spot at right back, gained more confidence and found her rhythm on the field.Huerta is a consistent starter on the back line for the Reign, which conceded the fewest goals of any team this season. While she's a force defensively, Huerta is also an expert crosser with an attacking mindset. She had four assists, which was among the league's best. And she helped OL Reign win the NWSL Shield, which is awarded to the club with the best record at the end of the resulgar season. While she initially played for the Mexico national team, she made a one-time FIFA switch and has been a regular face on the U.S. roster this year.Laken Litman covers college football, college basketball and soccer for FOX Sports. She previously wrote for Sports Illustrated, USA Today and The Indianapolis Star. She is the author of \"Strong Like a Woman,\" published in spring 2022 to mark the 50th anniversary of Title IX. Follow her on Twitter @LakenLitman.    Get more from United States Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"MLS Cup Playoffs: Philadelphia, New York set for ECF rematch","description":"The Union will be out for revenge when they host NYCFC for the Eastern Conference Finals. Doug McIntyre previews the MLS Cup Conference Finals.","url":"https://www.foxsports.com/stories/soccer/mls-cup-playoffs-philadelphia-new-york-set-for-ecf-rematch","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/mls.jpg?ve=1&tl=1","publishedAt":"2022-10-24T09:43:16Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nThe MLS Cup playoffs are down to the final four teams after Austin FC and defending champion New York City FC advanced Sunday, joining the Philadelphia Uni… [+6023 chars]","fullContent":"   By Doug McIntyreFOX Sports Soccer WriterThe MLS Cup playoffs are down to the final four teams after Austin FC and defending champion New York City FC advanced Sunday, joining the Philadelphia Union and LAFC in the conference finals. Austin dispatched in-state rival FC Dallas 2-1 Sunday night and will travel to Los Angeles to face the Supporters Shield winners next week. NYCFC's 3-1 win at CF Montreal sets up a can't-miss rematch with the Philadelphia Union, which lost in controversial fashion to the eventual 2021 champs at the same stage last year. Here are a few quick thoughts on Sunday's games and how the semis could shake out.  The Philadelphia Union-NYCFC rematch is must-watch  City went into Sunday's matinee as the underdog. They also went in with the swagger of a side that knows what it takes to win when it counts.  \"I don't see us as underdogs,\" Pigeons keeper Sean Johnson, who made two acrobatic first half saves to maintain the visitors' lead, told FOX Sports afterward.  The visitors scored twice on clinically executed counterattacks. The first came just six minutes in courtesy of the ageless Maxi Moralez, but the fatal blow arrived off the foot of Heber just before halftime, digging the hosts a hole too big to climb out of.Talles Magno added NYCFC's third from the penalty spot in the second half. The outcome was beyond doubt by the time Djordje Mihailovic pulled one back for Montreal with five minutes remaining. It was hugely impressive performance by the visitors. And it sets up a marquee Eastern Conference final between NYCFC and the Philadelphia Union next Sunday in Chester, Pennsylvania — the matchup the Union have been waiting almost 11 months for.Philly is desperate for revenge after their skeleton squad — nearly a dozen of Jim Curtin's players, including six starters, were sidelined under COVID protocols — lost on Magno's 88th minute strike last December, denying the Union their first MLS Cup trip in club history.\"Everybody knows what happened last year,\" Curtin told ESPN's broadcast team Sunday night. \"They were deserved champion last year for sure, but I also think they didn't get our best punch.\"  So top-seeded Philadelphia got their wish, and they'll be at or near full strength this time; captain Alejandro Bedoya is questionable because of injury. But this NYCFC team will also relish the challenge to prove that last year's triumph was no fluke. They'd love nothing more than to play the spoiler once again. \"Great place to play, great energy in the stadium,\" Johnson said of Subaru Park. \"We'll be ready.\" Austin tops FC Dallas, LAFC up next It was the same question all year for Austin FC. Are they for real? If finishing second in the Western Conference in the regular season didn't prove that Josh Wolff's side is legit, its run to the final four has. Don't let the narrow score line fool you – the Verde dominated their fellow Texas in front of another packed house in the capital Sunday night, their 18 shots doubling the visitors' tally. Austin's goals both came in the first half, via Moussa Djitté and Sebastián Driussi. Driussi's solo effort showed why he's a finalist for league MVP:  There's no reason Austin can't go to Banc of California Stadium next week and survive. They've already beaten LAFC home and away this season. And Carlos Vela & Co. were far from convincing in their playoff-opening victory over crosstown nemesis LA Galaxy last Thursday. Can Austin pull off the upset? If Wolff can coax a similar performance from his team next weekend, there's no question about it. FC Dallas will be back  Sunday's defeat  was a bitter one for the lone remaining original MLS club never to have reached an MLS Cup final. Still, 2022 was a step in the right direction for a team that had made it past round one of the playoffs just once in the previous five years.  After missing out on the tournament altogether last year, first-year coach Nico Estévez dragged FCD – which sold U.S. men's national team striker Ricardo Pepi last winter – back into the postseason. He got career seasons out of two other USMNT forwards, winger Paul Arriola and 18 goal-man Jesús Ferreira.He's got a talented young roster that will be better for the experience they got this fall.  That roster will be tweaked at least a little before 2023, no doubt. But the core – including Ferreira, who singed a long-term contract extension earlier this year – should be around long enough to ensure that FC Dallas can build on Estévez's successful maiden campaign at the helm. A disappointing end for Montreal  Following the best regular season in club history, CF Montreal fans had every reason to believe that the bleu-blanc-noir could become just the second Canadian club to hoist MLS Cup. They'd built a balanced roster of proven MLS veterans, members of the country's World Cup-bound national squad and hungry up-and-comers under Wilfried Nancy, who may yet be named the league's coach of the year.But they were thin up top, especially with top forward Romell Quioto nursing a sore thigh. There were questions in goal, too. Both issues bit them on Sunday. Montreal had plenty of chances, outshooting NYCFC 18-5, but couldn't find the net until it was too late. Keeper James Pantemis got caught in no man's land in the buildup to Moralez's opener, putting the hosts on the back foot almost from the start. It's a tough loss to swallow for a city and its long-suffering base of supporters that had dared to dream. Nancy has much to build on, though – even with Mihailovic off to Europe and captain Victor Wanyama also leaving the club. Montreal hadn't made the playoffs since 2016, the pandemic-expanded 2020 postseason aside, and took a big step this year. Sometimes you have to lose to learn how to win.  \"They're an exceptional team,\" NYCFC interim coach Nick Cushing said of Montreal. \"It will become a [championship] winning team, I'm sure of that.\"One of the leading soccer journalists in North America, Doug McIntyre has covered United States men’s and women’s national teams at multiple FIFA World Cups. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports. Follow him on Twitter @ByDougMcIntyre.    Get more from MLS Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"Takeaways off Round One of the MLS playoffs","description":"Here are five thoughts on Round One, and a look ahead at what’s on tap when postseason action resumes with a pair of games on Thursday.","url":"https://www.foxsports.com/stories/soccer/takeaways-off-round-1-of-the-mls-playoffs","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/trafico1.jpg?ve=1&tl=1","publishedAt":"2022-10-18T06:18:39Z","content":"By Doug McIntyre\r\nFOX Sports Soccer Writer\r\nThe conference finals are set and the MLS Cup playoffs are now down to eight teams after FC Dallas and defending champion New York City FC both advanced on… [+6645 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"USWNT's path to a World Cup three-peat comes into focus","description":"It looks like the U.S. could be on a collision course to meet England in the final, as the Americans hope to become the first team in the men’s and women’s game to win three straight World Cups.","url":"https://www.foxsports.com/stories/soccer/uswnt-path-to-a-world-cup-three-peat-comes-into-focus","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/10.21.22_USWNT_ThreePeat_Horizontal-1.jpg?ve=1&tl=1","publishedAt":"2022-10-22T19:42:50Z","content":"By Laken Litman\r\nFOX Sports Soccer Writer\r\nThe road to a Women's World Cup three-peat has become clearer for the United States Women's National Team.\r\nAnd it looks like the U.S. could be on a collisi… [+5590 chars]"},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"FOX Sports","title":"JuJu Smith-Schuster believes Call of Duty helped Chiefs win big over 49ers","description":"After the Chiefs' blowout win against the 49ers on Sunday, Kansas City WR JuJu Smith-Schuster credited Call of Duty for the team's offensive success.","url":"https://www.foxsports.com/stories/nfl/juju-smith-schuster-believes-call-of-duty-helped-chiefs-to-big-win-over-49ers","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/10.24.22_JuJu-Credits-Call-of-Duty-for-KCs-Win-Streak_16x9.jpg?ve=1&tl=1","publishedAt":"2022-10-24T21:10:40Z","content":"One week after mustering just 20 points in a home loss to the Buffalo Bills, the Kansas City Chiefs roared back with a 44-23 blowout of the San Francisco 49ers on the road Sunday. \r\nPatrick Mahomes t… [+2618 chars]","fullContent":"   One week after mustering just 20 points in a home loss to the Buffalo Bills, the Kansas City Chiefs roared back with a 44-23 blowout of the San Francisco 49ers on the road Sunday. Patrick Mahomes threw for over 400 yards in a game for the first time this season as top pass-catchers Travis Kelce, Marquez Valdes-Scantling and Juju Smith-Schuster all put up big numbers of their own.What sparked the offense? Smith-Schuster later revealed what he credits for the quartet's phenomenal performance — their success at Call of Duty: Warzone.\"What got us the chemistry we needed this game – it was Friday night, it was me, Pat, Travis and [Marquez], and we were playing Call of Duty together,\" Smith-Schuster said. \"We were playing Warzone, and we played three games. We won three games back-to-back… It's really hard to win a game in Warzone. \"You could just tell, the communication between all of us and the chemistry, it was like we were in the game. It just kind of led into [Sunday's] game, just kind of showed on the field.\"Smith-Schuster then went on to explain how Warzone is played – several squads of video game characters land on an online map and collect weapons. The team left standing at the end of the battle royale wins.Patrick Mahomes, Chiefs offense dismantle 49ers in Week 7       Mahomes said that he does not play Call of Duty as much as his teammates do, but did confirm he hopped on with them Friday because he \"had a free night.\"\"Marquez and JuJu are really good [at Call of Duty],\" Mahomes said. \"Me and Travis are just all right. But we did our part, and we went 3-for-3 with three wins in Warzone, which I don't do often, so I felt pretty good about it going into the game.\"When you get away from the [team] facility, you're doing kid-like things, you're on the headset and talking and joking around and talking about the week, it gets your mind off of just football, and it's about building those relationships.\"Those relationships flourished on the field at Levi's Stadium Sunday. Kelce celebrated National Tight End Day with six catches for 98 yards, while both Valdez-Scantling and Smith-Schuster had over 100 receiving yards each. Valdez-Scantling notched 111 yards on three catches, while Smith-Schuster had 124 yards and a touchdown on seven catches. Smith-Schuster also copied soccer superstar Cristiano Ronaldo's iconic goal celebration after his score to cap off a good day.Mahomes, meanwhile, completed 25 of 34 passes for 423 yards and threw three touchdowns and an interception. Smith-Schuster, a longtime avid video game enthusiast, had a very appropriate analogy for his quarterbacks' performance Sunday – the Madden \"Superstar X-Factor\" mode.\"It was like fire,\" Smith-Schuster said. \"I was like, ‘Dang, he’s on his X-Factor.'\"Patrick Mahomes passes for 423 yds, 3 TDs en route to win vs. 49ers       The Chiefs are currently 5-2 through Week 7 and first in the AFC West heading into their Week 8 bye.    Get more from National Football League Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":null,"title":"Why Phillies superstar Bryce Harper is 'exactly what baseball needs'","description":"Bryce Harper's swagger is leading the way for the Phillies this postseason, and Colin Cowherd thinks that's great for baseball.","url":"https://www.foxsports.com/stories/mlb/why-phillies-superstar-bryce-harper-is-exactly-what-baseball-needs","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/11/1408/814/Bryce-Harper-Game-3.png?ve=1&tl=1","publishedAt":"2022-11-02T21:04:28Z","content":"Bryce Harper led the Philadelphia Phillies to a commanding 7-0 win over the Houston Astros in Game 3 of the World Series.\r\nThe two-time MVP opened up the scoring in the first inning when he crushed L… [+2903 chars]","fullContent":"   Bryce Harper led the Philadelphia Phillies to a commanding 7-0 win over the Houston Astros in Game 3 of the World Series.The two-time MVP opened up the scoring in the first inning when he crushed Lance McCllurers' pitch 402 feet to right field to give the Phillies a 2-0 lead. Citizens Bank Park erupted once the ball landed in the seats, marking the first home run in a Phillies World Series home game in 13 years.Colin Cowherd recognized the energy Harper immediately brought with his home run. \"When Bryce Harper hit that bomb, that home run, the video of the fans in the stands was some of the craziest stuff I’ve ever seen,\" Cowherd said on Wednesday's \"The Herd.\" \"Maybe it's because Philadelphia hasn't won a lot recently. They're a very intense fan base. But the reaction in the crowd … people were leaving their seats and jumping and hugging. It looked like it was a college football crowd … national championship.\"Bryce Harper cranks a two-run home run to give the Phillies an early 2-0 lead       \n    Bryce Harper cranks a two-run home run to give the Philadelphia Phillies an early 2-0 lead against the Houston Astros in Game 3 of the World Series.\n  The crowd's reaction to Harper's home run made Cowherd realize that the 30-year-old slugger, who has \"had the weight of the world on his shoulders since he was on the cover of Sports Illustrated at 16 years old,\" is finally being allowed to have fun. \"Remember when Bryce Harper came into sport? He had the big hair and the big flair, and he kept saying ‘We’re not having enough fun in the sport,'\" Cowherd said. \"One of his teammates was all over him that he was too showy. Remember, Bryce Harper battled some of his teammates early when he said ‘We’ve got to have more fun. Football guys are having fun. Soccer guys are having fun. Hockey guys are having fun. Why can't we have fun?' It's baseball, there's a way we have to play the game.\"Now, Harper is leading a Phillies team that appears to be having fun night-in and night-out, especially during this year's postseason. Harper's home run was the first of five the Phillies hit off McCullers, which was the most a pitcher has given up in a World Series game. Kyle Schwarber's 443-foot blast to center field in the fifth inning prompted a similar reaction from the Philly crowd as the slugger marveled at the ball for a few moments while still in the box.Kyle Schwarber and Rhys Hoskins hit back-to-back home runs in Game 2.       \n    Kyle Schwarber and Rhys Hoskins hit back-to-back home runs to give the Phillies a 7-0 lead against the Houston Astros.\n  \"It is so great now, so refreshing to see this Philadelphia team. … They celebrate like a college baseball team in Omaha,\" Cowherd said. \"They celebrate like college kids do. Harper came in this league and got a ton of pushback from veterans because he had too much style, and he had the big hair. Folks, since when is that a bad thing for sports? It is a great thing for sports.\"Cowherd believes Harper and the city of Philadelphia are a perfect fit.\"This is the freest he's ever been able to be,\" Cowherd said. \"Is there a player in baseball that's more connected to their fan base than Bryce Harper in Philadelphia? If he was sitting in right field and knocking down a Budweiser, he'd look like a Philadelphia fan, but, you know, more ripped.\"Cowherd believes baseball needs more players like Harper, who bring more \"connectability and flair\" to the game.\"This is exactly what baseball needs,\" Cowherd said. \"Bryce Harper is having the time of his life.\"    Get more from Major League Baseball Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"France star Paul Pogba ruled out of 2022 World Cup with knee injury","description":"France will be without two of their star midfielders at the 2022 World Cup. Doug McIntyre explains what Paul Pogba's injury means for the reigning world champs.","url":"https://www.foxsports.com/stories/soccer/france-star-paul-pogba-ruled-out-of-2022-world-cup-with-knee-injury","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/pogba1.jpg?ve=1&tl=1","publishedAt":"2022-10-31T17:47:47Z","content":"France will be without another key midfielder when Les Bleus begin their World Cup title defense next month at the 2022 event in Qatar.\r\nA little more than two weeks after it was revealed that N'Golo… [+2607 chars]","fullContent":"   France will be without another key midfielder when Les Bleus begin their World Cup title defense next month at the 2022 event in Qatar.A little more than two weeks after it was revealed that N'Golo Kanté wouldn't be recovered from his torn hamstring in time to participate in the planet's most popular sporting event, Paul Pogba, another vital member of France's 2018 World Cup-winning side, has been ruled out after suffering a setback from the knee injury he originally sustained in July, according to his agent. Pogba was hurt in a preseason match with Italian club Juventus and hasn't played since. He had the knee operated on in September.\"Paul Pogba will still need recovery time from his surgery,\" the agent, Rafaela Pimenta said Monday in a statement shared with Agence France-Presse and other outlets. \"For this reason, Paul will not be able to join Juventus' squad before the World Cup break nor the French national team in Qatar.\"Pogba, 29, was instrumental in his country's 2018 triumph, starting six of France's seven games. (He was rested for the group stage finale against Denmark after Les Bleus had already qualified for second round.) He played every minute of the knockout phase, including the 4-2 win over Croatia in the final. Monday's news is the latest setback in a string of them for Les Bleus coach Didier Deschamps. France enters the 2022 World Cup, which begins when the hosts meet Ecuador on Nov. 20, having won just once in their last six competitive matches.Pogba had been in the news earlier in October, as the victim of an extortion plot allegedly involving his brother. Another potential off-field distraction involved star forward Kylian Mbappe, who boycotted a pre-World Cup photoshoot over an image-rights dispute with the French Football Federation that has since been settled.Drawn into Group D, France plays its World Cup first match Nov. 22 against Australia. They'll face the Danes — a squad that has already beaten Les Bleus twice this year, including in September in their final pre-tourney game — four days later before wrapping up their group slate Nov. 30 versus Tunisia.One of the most talented Qatar-bound teams even without Pogba or Kanté, France has a recent history of imploding at every other World Cup. The last time they entered the competition as the titleholder, in 2002, they went winless in three matches and failed to score a goal. They also bombed out in the first round in 2010, four years after losing on penalties to Italy in the final at Germany '06.One of the leading soccer journalists in North America, Doug McIntyre has covered United States men’s and women’s national teams at multiple FIFA World Cups. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports. Follow him on Twitter @ByDougMcIntyre.    Get more from FIFA World Cup 2022 Follow your favorites to get information about games, news and more        "},{"source":{"id":"fox-sports","name":"Fox Sports"},"author":"Doug McIntyre","title":"USMNT star Weston McKennie to miss 'at least' 15 days with thigh injury","description":"One injury setback could jeopardize Weston McKennie's chances of playing in the World Cup, Doug McIntyre writes.","url":"https://www.foxsports.com/stories/soccer/usmnt-star-weston-mckennie-to-miss-at-least-15-days-with-thigh-injury","urlToImage":"https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/10/1408/814/weston.jpg?ve=1&tl=1","publishedAt":"2022-10-30T22:02:12Z","content":"United States men's national team midfielder Weston McKennie is in a race against time to be healthy for the start of the 2022 FIFA World Cup.\r\nMcKennie will be out at least 15 days with a thigh inju… [+2446 chars]","fullContent":"   United States men's national team midfielder Weston McKennie is in a race against time to be healthy for the start of the 2022 FIFA World Cup.McKennie will be out at least 15 days with a thigh injury, according to multiple reports. Sky Sports Italia broke the news on Sunday, a day after the 24-year-old Texan was substituted at halftime of Juventus 1-0 win over Lecce in Serie A, Italy's top division. The World Cup kicks off in Qatar on Nov. 20. The Americans play their first game in the competition the following day, against Wales. The U.S. will also meet England and Iran in the group stage.Most of the European club-based U.S. players are expected to arrive in Doha on Nov. 13. Because Juventus plays Lazio that day, McKennie was scheduled to fly travel on Nov. 14, one week before the USA's opening match. It's not clear if McKennie's injury would allow him to travel to Qatar earlier now that he's been ruled out of the Lazio match.Should USMNT fans be WORRIED with Weston McKennie's performances with Juventus?       \n    Alexi Lalas and David Mosse debate whether there should be concern with USMNT's Weston McKennie due to his recent performances for Juventus.\n  It's also not clear how much the two week-plus layoff will impact his match fitness — assuming he recovers in time. Any setback in McKennie's recovery would put his participation against Wales in doubt. McKennie missed the final three months of the European season last year, plus the final set of World Cup qualifiers for the U.S., after breaking his foot in a UEFA Champions League game against Spain's Villarreal.With 13 starts in 16 Serie A and UEFA Champions League games, McKennie has been a mainstay in Maxi Allegri's lineup this season despite Juve's struggles in both competitions. Juve, which sits seventh in Serie A standings, was eliminated from the Champions League last week after a 4-3 loss at Portuguese club Benfica. McKennie scored in that match, his second in Europe's top club competition this season. He netted his first Serie A goal the week before, against Empoli.McKennie has nine goals in 37 appearances for the U.S. since making his debut in 2017. He's just the latest injured American World Cup roster hopeful hoping to healthy in time for the competition, a list that includes Celta Vigo midfielder Luca de la Torre, Crystal Palace defender Chris Richards, Norwich City striker Josh Sargent and Arsenal goalkeeper Matt Turner. The U.S. men are back in the World Cup for the first time in eight years, having failed to qualify for years ago for the first time in more than three decades.One of the leading soccer journalists in North America, Doug McIntyre has covered United States men’s and women’s national teams at multiple FIFA World Cups. Before joining FOX Sports in 2021, he was a staff writer with ESPN and Yahoo Sports. Follow him on Twitter @ByDougMcIntyre.    Get more from United States Follow your favorites to get information about games, news and more        "}]